{
    "py/object": "module_1.redder.subredder",
    "snapshotTime": 1697439991,
    "id": "2qh8m",
    "name": "singularity",
    "description": "Everything pertaining to the technological singularity and related topics, e.g. AI, human enhancement, etc.",
    "posts": [
        {
            "py/object": "module_1.redder.post",
            "creationTime": 1697437127,
            "id": "178zezr",
            "author": "deerhunter783",
            "title": "Was AGI achieved internally?",
            "body": "",
            "score": 0,
            "upvoteRatio": 0.33,
            "comments": [
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697437893,
                    "id": "k531in0",
                    "parent_id": null,
                    "author": "Zeikos",
                    "score": 1,
                    "body": "I'd say that ChatGPT's intelligence is quite general already.  \nThere's a spectrum on generality, I honestly think that the goal now is to get less general but more performant agents interacting together to get a better outcome."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697437604,
                    "id": "k5314tv",
                    "parent_id": null,
                    "author": "None",
                    "score": 0,
                    "body": "[deleted]"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697438509,
                    "id": "k532be0",
                    "parent_id": "t1_k531in0",
                    "author": "Wassux",
                    "score": 1,
                    "body": "General intelligence means it understands the world and can learn anything with just simple instructions. That it can figure out new methods by itself. Idk if gpt4 falls under that yet\n\nI tried to let it help me with some uni homework a while ago and it failed completely"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697438291,
                    "id": "k5321ad",
                    "parent_id": "t1_k531in0",
                    "author": "Akimbo333",
                    "score": 1,
                    "body": "I'm thinking that people are talking about AGI being able to see and hear."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697437878,
                    "id": "k531hyo",
                    "parent_id": "t1_k5314tv",
                    "author": "deerhunter783",
                    "score": 1,
                    "body": "I’m pretty sure it’s already updated I just don’t want to click the details thing"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697438919,
                    "id": "k532ud5",
                    "parent_id": "t1_k532be0",
                    "author": "Zastinff",
                    "score": 1,
                    "body": "what's your uni homework about"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697439279,
                    "id": "k533ba9",
                    "parent_id": "t1_k532be0",
                    "author": "Seidans",
                    "score": 1,
                    "body": "given that gpt4 suffer from memory loss it's unlikely that he would learn anything\n\nlong-term memory is probably the next big step to achieve AGI and \"long\" mean decade, like human memory, i don't think anyone want to exchange with an AI that forget most things you said 1month ago and we don't have the technology for that yet"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697438245,
                    "id": "k531z64",
                    "parent_id": "t1_k531hyo",
                    "author": "apoca-ears",
                    "score": 1,
                    "body": "Pro tip: If you click the x it will go away"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697438285,
                    "id": "k532102",
                    "parent_id": "t1_k531z64",
                    "author": "deerhunter783",
                    "score": 1,
                    "body": "Nah"
                }
            ]
        },
        {
            "py/object": "module_1.redder.post",
            "creationTime": 1697428286,
            "id": "178x5p1",
            "author": "cleare7",
            "title": "Google’s AI Is Making Traffic Lights More Efficient and Less Annoying",
            "body": "",
            "score": 11,
            "upvoteRatio": 0.99,
            "comments": [
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697432822,
                    "id": "k52uau0",
                    "parent_id": null,
                    "author": "cleare7",
                    "score": 2,
                    "body": "This is an article about Google’s AI-powered traffic light optimization system. It discusses the system’s ability to reduce wait times and emissions. **Google analyzes Maps data to identify intersections where adjustments could be made. The company has seen promising results in cities around the world.**\n\nExcerpt:\n>Seattle is among a dozen cities across four continents, including Jakarta, Rio de Janeiro, and Hamburg, optimizing some traffic signals based on insights from driving data from Google Maps, aiming to reduce emissions from idling vehicles. The project analyzes data from Maps users using AI algorithms and has initially led to timing tweaks at 70 intersections. **By Google’s preliminary accounting of traffic before and after adjustments tested last year and this year, its AI-powered recommendations for timing out the busy lights cut as many as 30 percent of stops and 10 percent of emissions for 30 million cars a month.**"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697432289,
                    "id": "k52tgov",
                    "parent_id": null,
                    "author": "La_flame_rodriguez",
                    "score": 2,
                    "body": "we need good open source ai's alternatives now. Few corporations capitalizing too much  data sound extremely cyberpunk.\nu kno what im saying?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435539,
                    "id": "k52yayk",
                    "parent_id": null,
                    "author": "sdmat",
                    "score": 1,
                    "body": "https://www.youtube.com/watch?v=QR10t-B9nYY"
                }
            ]
        },
        {
            "py/object": "module_1.redder.post",
            "creationTime": 1697426702,
            "id": "178wozs",
            "author": "Routine_Complaint_79",
            "title": "Self-Taught Optimizer (STOP): Recursively Self-Improving Code Generation",
            "body": "I don't think I've seen anyone talk about this study yet, seems like a pretty big step towards the Singularity.\n\n[https://arxiv.org/abs/2310.02304](https://arxiv.org/abs/2310.02304)",
            "score": 24,
            "upvoteRatio": 0.94,
            "comments": [
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427498,
                    "id": "k52l2iv",
                    "parent_id": null,
                    "author": "SharpCartographer831",
                    "score": 10,
                    "body": "The authors are from Microsoft and Stanford University, not some fantasists, hmm...\n\n>Several recent advances in AI systems (e.g., Tree-of-Thoughts and Program-Aided Language Models) solve problems by providing a \"scaffolding\" program that structures multiple calls to language models to generate better outputs. A scaffolding program is written in a programming language such as Python. In this work, we use a language-model-infused scaffolding program to improve itself. We start with a seed \"improver\" that improves an input program according to a given utility function by querying a language model several times and returning the best solution. We then run this seed improver to improve itself. Across a small set of downstream tasks, the resulting improved improver generates programs with significantly better performance than its seed improver. Afterward, we analyze the variety of self-improvement strategies proposed by the language model, including beam search, genetic algorithms, and simulated annealing. Since the language models themselves are not altered, this is not full recursive self-improvement. Nonetheless, it demonstrates that a modern language model, GPT-4 in our proof-of-concept experiments, is capable of writing code that can call itself to improve itself. We critically consider concerns around the development of self-improving technologies and evaluate the frequency with which the generated code bypasses a sandbox.\n\n\n> While the model does not optimize its weights or underlying architecture, this work indicates\nthat self-optimizing language models do not require that. However, this is itself a motivation: the\ncapabilities of future language models may be misunderstood if strong scaffolding strategies are\nnot tested. Understanding the ways language models improve their scaffolding with STOP can help\nresearchers understand and mitigate the potential for misuse of more powerful language models.\nMoreover, STOP may allow researchers to investigate the effectiveness of different techniques for\nmitigating undesirable self-improvement strategies"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427962,
                    "id": "k52m146",
                    "parent_id": null,
                    "author": "MassiveWasabi",
                    "score": 10,
                    "body": "It was posted last week but it went somewhat unnoticed: https://www.reddit.com/r/singularity/comments/171igxt/microsofts_new_paper_recursive_self_improvement/\n\nOne of the authors of the paper even chimed in to clarify a few things"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697438133,
                    "id": "k531trz",
                    "parent_id": null,
                    "author": "Akimbo333",
                    "score": 1,
                    "body": "Is it any good?"
                }
            ]
        },
        {
            "py/object": "module_1.redder.post",
            "creationTime": 1697421068,
            "id": "178uxyf",
            "author": "BeginningInfluence55",
            "title": "So where do you estimate Gemini will position itself realistically? Between GPT-3.5 and -4? Superior to GPT-4?",
            "body": "Honestly, if Gemini doesn't excel beyond GPT-4 in every aspect, it would be underwhelming.\n\nRemember, GPT-3.5 uses technology that's three years old. Even GPT-4, which finished training in Q2 2022, is now 1.5 years old. By late 2023, we'd expect Gemini to represent the cutting edge.",
            "score": 61,
            "upvoteRatio": 0.9,
            "comments": [
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697422769,
                    "id": "k52b29k",
                    "parent_id": null,
                    "author": "derivedabsurdity77",
                    "score": 119,
                    "body": "Well above GPT-4 at minimum, anything below that will be an abject failure."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697425019,
                    "id": "k52fzvz",
                    "parent_id": null,
                    "author": "Wobblewobblegobble",
                    "score": 18,
                    "body": "Idk everyone shits on google but I believe it will be a very strong competitor against anything out at minimum"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427272,
                    "id": "k52km52",
                    "parent_id": null,
                    "author": "Curiosity_456",
                    "score": 21,
                    "body": "Honestly if it’s even equal to GPT-4 that’s considered a failure. Google had over 6 months to analyze GPT-4 and understand its weaknesses so they should have something better than it at the bare minimum."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427538,
                    "id": "k52l5qb",
                    "parent_id": null,
                    "author": "SurroundSwimming3494",
                    "score": 28,
                    "body": "It's kinda crazy (and *really* fringe) how this sub looks forward to AI model releases the same way gamers look forward to the release of the next PS/Xbox consoles, NFL fans look forward to the Super Bowl, Taylor Swift's fans look forward to her album, etc."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697428963,
                    "id": "k52nx46",
                    "parent_id": null,
                    "author": "Nervous-Newt848",
                    "score": 8,
                    "body": "When Gemini comes out, OpenAI will have already finished training GPT 5..."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427917,
                    "id": "k52lxy5",
                    "parent_id": null,
                    "author": "Old-Owl-139",
                    "score": 14,
                    "body": "If Gemini is inferior to GPT-4 I will expect Google stock to go down hard.  Google has no options, it has to be better that GPT-4."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697428981,
                    "id": "k52ny9j",
                    "parent_id": null,
                    "author": "Thundergawker",
                    "score": 5,
                    "body": "What is this an anime power scaling sub?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697425370,
                    "id": "k52gqxp",
                    "parent_id": null,
                    "author": "Status-Shock-880",
                    "score": 7,
                    "body": "I heard it can cook toast!"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697429438,
                    "id": "k52orej",
                    "parent_id": null,
                    "author": "meatlamma",
                    "score": 6,
                    "body": "It's Google, so I suspect it will be underwhelming. Google is just so mid and meh"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697432026,
                    "id": "k52t20v",
                    "parent_id": null,
                    "author": "mvandemar",
                    "score": 3,
                    "body": "Multimodality and the ability to base answers on current data will not impress me at this point, it needs to be a significant step above GPT-4 or 4.5 will just blow it out of the water. I am basing this on how much more GPT-4 was compared to 3.5."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697426414,
                    "id": "k52iwfd",
                    "parent_id": null,
                    "author": "extopico",
                    "score": 6,
                    "body": "Gemini has to go well beyond GPT-4, and not just in multimodality, otherwise Google has lost."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697422829,
                    "id": "k52b74x",
                    "parent_id": null,
                    "author": "Kinexity",
                    "score": 22,
                    "body": "I estimate it will be a model of all time.\n\n>!Now stfu with all those questions about how good it will be. Find something to do. Speculation without any basis will give you nothing.!<"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697426756,
                    "id": "k52jlkf",
                    "parent_id": null,
                    "author": "AdaptivePerfection",
                    "score": 6,
                    "body": "Speculation on release date only, please. We’ll know its capabilities within 5 minutes of using it."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697426345,
                    "id": "k52ircp",
                    "parent_id": null,
                    "author": "sidspodcast",
                    "score": 8,
                    "body": "They are taking forever to release it. What a joke. Google has been super lame with LLM as of now. Bard was super lame.\n\nIf Gemini absolutely doesn’t blow our minds away in awe 🎆 then Google better stfu"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697428070,
                    "id": "k52m8rr",
                    "parent_id": null,
                    "author": "Prestigious_Ebb_1767",
                    "score": 2,
                    "body": "When I use Google they still have the Bard experimental search results going and it’s so god awful. I hope Gemini can code amazingly well because I’ve yet to see Bard not hallucinate and make up random ass libraries."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697429493,
                    "id": "k52ouu3",
                    "parent_id": null,
                    "author": "Working_Berry9307",
                    "score": 2,
                    "body": "It will be slightly better than gpt4 or about at gpt4's level. Decent chance in some ways it's worse. \n\nThat would be my guess at least. Too much hype, Google is behind openai and still playing catch up."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697433059,
                    "id": "k52uns9",
                    "parent_id": null,
                    "author": "Ordowix",
                    "score": 2,
                    "body": "Gemini will be worse than GPT-4 in most aspects. I guarantee. Google's terrible at executing AI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434019,
                    "id": "k52w42f",
                    "parent_id": null,
                    "author": "LayliaNgarath",
                    "score": 2,
                    "body": "What I am waiting for is an AI that can pull from multiple online data sources, correlate information between them (without hallucinations) and then present a result that includes the method used to find the answer. Given that a large part of making that happen would be finding relevant data sources in the first place, this sounds like a job for a Google shaped AI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424414,
                    "id": "k52ep4f",
                    "parent_id": null,
                    "author": "WokeAssBaller",
                    "score": 1,
                    "body": "I know some people with access to it and they said w.r.t. reasoning it blows gpt-4 out of the water"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697426059,
                    "id": "k52i6s8",
                    "parent_id": null,
                    "author": "metalman123",
                    "score": 1,
                    "body": "Open source will match gpt 4 in roughly 6 months or less.\n\nGemini better blow gpt 4 out of the water."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427793,
                    "id": "k52lp5r",
                    "parent_id": null,
                    "author": "MisterViperfish",
                    "score": 1,
                    "body": "I suspect it will be “different”, but people will argue as to whether or not it is better. Each will probably have its own areas of functional superiority. In terms of raw power, I suspect it will have some advantage, but GPT-4 has the advantage of the sort of polish and refinement that comes with being released first. But we will see another significant jump soon enough. I’m certain of it."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424159,
                    "id": "k52e4yt",
                    "parent_id": null,
                    "author": "None",
                    "score": -1,
                    "body": "[deleted]"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697421281,
                    "id": "k527mgq",
                    "parent_id": null,
                    "author": "aue_sum",
                    "score": -17,
                    "body": "the improvement will probably only be half of what it was between 4 and 3.5. And that's the best case. The technology is flattening out and the outlook for AGI is looking bleak."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434278,
                    "id": "k52whri",
                    "parent_id": null,
                    "author": "cool-beans-yeah",
                    "score": 1,
                    "body": "I think it will blow gpt 4 right out of the water.\n\nThey have shifted all their focus on AI. Given the amount of money they have this might turn out to be AGI; if not immediately then with a couple of fine tunings, a lá Chatgpt."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435672,
                    "id": "k52yho8",
                    "parent_id": null,
                    "author": "Zeta-Splash",
                    "score": 1,
                    "body": "[Remember that guy from google that got kicked out because he swore the machine had created feelings and was indistinguishable from a human?](https://amp.cnn.com/cnn/2022/07/23/business/google-ai-engineer-fired-sentient/index.html)\n\nI think that was (what they now call) Gemini, a nerfed version of it… Obviously not sentient but definitely powerful enough to fool an engineer that works on the program itself."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436164,
                    "id": "k52z67g",
                    "parent_id": null,
                    "author": "FeltSteam",
                    "score": 1,
                    "body": "Their are different model sizes, the largest of which i think will be more performant than GPT-4. Probably not the same leap we took from GPT-3.5 to 4, but still something. But there are other things which will make it really useful, like reducing hallucinations and making it more multimodal."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436416,
                    "id": "k52zj15",
                    "parent_id": null,
                    "author": "cutmasta_kun",
                    "score": 1,
                    "body": "Way worse than GPT3.5"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697439664,
                    "id": "k533sv2",
                    "parent_id": null,
                    "author": "andresni",
                    "score": 1,
                    "body": "I use Bard over GPT4 because it integrates with gmail and google drive, and has a fact checker that works so-so. If Gemini is on par with GPT4, I'd consider it a win. As calendar and other apps gets integrated too, we're one step closer to a proper Jarvis. That's the real killer app. It's not the best model that will win the race, but the best integration. And on that end it's Microsoft vs Google vs Apple."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424047,
                    "id": "k52dvui",
                    "parent_id": "t1_k52b29k",
                    "author": "submarine-observer",
                    "score": 65,
                    "body": "Google these days has no shortage of failures."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430602,
                    "id": "k52qq93",
                    "parent_id": "t1_k52b29k",
                    "author": "Radiofled",
                    "score": 6,
                    "body": "Well above would be very impressive indeed. I feel like even being noticeably superior to gpt 4 would be a huge accomplishment."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697425099,
                    "id": "k52g6a0",
                    "parent_id": "t1_k52b29k",
                    "author": "apoca-ears",
                    "score": 10,
                    "body": "What would “well above GPT-4” look like? No hallucinations? Larger context? Or something else like new architecture or technology entirely?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697429956,
                    "id": "k52pnd9",
                    "parent_id": "t1_k52b29k",
                    "author": "nickmaran",
                    "score": 1,
                    "body": "It better be. I've bought many Google stocks coz of Gemini"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434153,
                    "id": "k52wb61",
                    "parent_id": "t1_k52b29k",
                    "author": "ChatgptModder",
                    "score": 1,
                    "body": "It will suck ,"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436078,
                    "id": "k52z1z3",
                    "parent_id": "t1_k52b29k",
                    "author": "FeltSteam",
                    "score": 1,
                    "body": "There are different model sizes, the smaller ones will be below GPT-4 performance. And i wouldn't say anything below GPT-4 would be a failure. Like if they get slightly better performance but more multimodal and reduce hallucinations to like 1-5% than that will make it much more useful than GPT-4."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430223,
                    "id": "k52q3eg",
                    "parent_id": "t1_k52km52",
                    "author": "jamSpaceJackson2",
                    "score": 16,
                    "body": "Google also invented the transformer and has a fuckton of money and resources."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434341,
                    "id": "k52wl1m",
                    "parent_id": "t1_k52l5qb",
                    "author": "faux_something",
                    "score": 15,
                    "body": "It’s what this sub’s all about"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436514,
                    "id": "k52zo20",
                    "parent_id": "t1_k52l5qb",
                    "author": "Ok-Mess-5085",
                    "score": 2,
                    "body": "\"Gamers, waiting for the Super Bowl, and Taylor Swift albums are not as important as AI models' releases, which improve our lives. I doubt gamers, the anticipation of the Super Bowl, or Taylor Swift's albums can cure cancer.\""
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434255,
                    "id": "k52wgja",
                    "parent_id": "t1_k52l5qb",
                    "author": "Daealis",
                    "score": -1,
                    "body": "I also find the hyperbole ridiculous. Unless their new attempt at a public AI model is immediately beating every competitor by a mile, it's considered an abject failure?\n\nAlternatively, if their model is more modular and can be updated without taking a six month turnover each time, their model could be improved faster and go from GPT 3 to surpassing 4 in the next year - provided Google doesn't slash the project like they tend to do with their other projects."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697429932,
                    "id": "k52pltk",
                    "parent_id": "t1_k52l5qb",
                    "author": "Formal-Dentist-1680",
                    "score": -9,
                    "body": "I guess everyone else is just too dumb or too emotional or too busy to understand what's going on"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697429944,
                    "id": "k52pml3",
                    "parent_id": "t1_k52nx46",
                    "author": "Iamreason",
                    "score": 6,
                    "body": "They don't have H100s running yet and can't train 5 until they do have them. \n\nGemini will be out by the first week of December."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430264,
                    "id": "k52q5to",
                    "parent_id": "t1_k52lxy5",
                    "author": "jamSpaceJackson2",
                    "score": 7,
                    "body": "I honestly think they’d just quietly not release it if that were the case"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697433478,
                    "id": "k52valr",
                    "parent_id": "t1_k52ny9j",
                    "author": "IronPheasant",
                    "score": 2,
                    "body": "Yeah, doublings were foundational to the entire idea. For decades nothing happens, and then you have enough power to create the machine god.\n\nThe endgame literally takes place in space, where machines have a notable edge over meat. Reality might turn out to be Gurren Lagann??"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430299,
                    "id": "k52q7z6",
                    "parent_id": "t1_k52orej",
                    "author": "jamSpaceJackson2",
                    "score": 9,
                    "body": "Google hasn’t had this much pressure on them in a long time though"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697428970,
                    "id": "k52nxje",
                    "parent_id": "t1_k52b74x",
                    "author": "Embarrassed-Map1292",
                    "score": 3,
                    "body": "What a great response. It feels like everyone in this sub is waiting for AGI to save them from their situation be it financial or physical when they dont realize they have the power to save themselves."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430658,
                    "id": "k52qtlo",
                    "parent_id": "t1_k52jlkf",
                    "author": "Radiofled",
                    "score": 8,
                    "body": "Will we? I feel like it took months to start to flesh out gpt 4s abilities."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427287,
                    "id": "k52kn72",
                    "parent_id": "t1_k52ircp",
                    "author": "94746382926",
                    "score": 5,
                    "body": "It hasn't even been 6 months since they announced it, chill."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697426232,
                    "id": "k52ijcb",
                    "parent_id": "t1_k52ep4f",
                    "author": "sidspodcast",
                    "score": 7,
                    "body": "Whoa. 🤯 I wish had friends like yours"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424996,
                    "id": "k52fy4m",
                    "parent_id": "t1_k52ep4f",
                    "author": "lost_in_trepidation",
                    "score": 6,
                    "body": "How do they have access?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430147,
                    "id": "k52pywn",
                    "parent_id": "t1_k52ep4f",
                    "author": "jamSpaceJackson2",
                    "score": 2,
                    "body": "What does wrt mean"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697426583,
                    "id": "k52j96i",
                    "parent_id": "t1_k52i6s8",
                    "author": "maskedpaki",
                    "score": 20,
                    "body": "Open source isn't anywhere near gpt4 and the rate of improvement isnt that fast\n\nWe've only gone up 1% on MMLU since llama 2 in July for open source. It's not gonna catch up anytime soon."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697429821,
                    "id": "k52pevq",
                    "parent_id": "t1_k52i6s8",
                    "author": "Iamreason",
                    "score": 4,
                    "body": "Open source is entirely dependent on what Meta builds.  Meta will beat GPT-4 in 6 months and people will fine tune that model for marginal improvements.\n\nOpen source goes as far as Meta and the UAE take it and not much further."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427487,
                    "id": "k52l1p4",
                    "parent_id": "t1_k52i6s8",
                    "author": "Curiosity_456",
                    "score": 4,
                    "body": "Dude open source has nowhere near the talent pool that OpenAI has lol."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424969,
                    "id": "k52fw11",
                    "parent_id": "t1_k52e4yt",
                    "author": "lost_in_trepidation",
                    "score": 3,
                    "body": "Where'd you hear this?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424970,
                    "id": "k52fw5g",
                    "parent_id": "t1_k52e4yt",
                    "author": "apoca-ears",
                    "score": 3,
                    "body": "Where did you hear that"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697422372,
                    "id": "k52a6dp",
                    "parent_id": "t1_k527mgq",
                    "author": "yeahprobablynottho",
                    "score": 15,
                    "body": "Lmao what kinda braindead take is this"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697426190,
                    "id": "k52ig6p",
                    "parent_id": "t1_k527mgq",
                    "author": "sidspodcast",
                    "score": 6,
                    "body": "Lmao who is the AGI hater lol"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435684,
                    "id": "k52yi9p",
                    "parent_id": "t1_k52yho8",
                    "author": "AmputatorBot",
                    "score": 1,
                    "body": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.cnn.com/2022/07/23/business/google-ai-engineer-fired-sentient/index.html](https://www.cnn.com/2022/07/23/business/google-ai-engineer-fired-sentient/index.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697431916,
                    "id": "k52svmi",
                    "parent_id": "t1_k52dvui",
                    "author": "jeditech23",
                    "score": 9,
                    "body": "No no no, I WANT to pay $12/mo for YouTube! \nIt's an excellent idea"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697431703,
                    "id": "k52sjbi",
                    "parent_id": "t1_k52dvui",
                    "author": "mvandemar",
                    "score": 2,
                    "body": "They're really good at hype though."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697433793,
                    "id": "k52vrz7",
                    "parent_id": "t1_k52dvui",
                    "author": "Daealis",
                    "score": 1,
                    "body": "These days? They have a tendency of overpromise and under-delivery rivaling Peter Molyneux. Not to mention that projects failing to instantly make billions are abandoned within a year. This has been their MO of several decades at this point."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697426363,
                    "id": "k52ismz",
                    "parent_id": "t1_k52g6a0",
                    "author": "maskedpaki",
                    "score": 18,
                    "body": "MMLU score in the 90s at least. Coding abilities that are a tier above i.e can solve at least 50% of leetcode hard problems etc"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697425426,
                    "id": "k52guyo",
                    "parent_id": "t1_k52g6a0",
                    "author": "derivedabsurdity77",
                    "score": 10,
                    "body": "Very few hallucinations, superiority at problem-solving and reasoning, autonomy, long-term planning and memory, etc. Also multimodality, obviously."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697433953,
                    "id": "k52w0m2",
                    "parent_id": "t1_k52g6a0",
                    "author": "HappyCamperPC",
                    "score": 3,
                    "body": "I've noticed a couple of \"tells\" that an article has been written by ChatGPT or similar AI.\n\n1. Overuse of certain works like \"delve\" not generally used in human writing.\n2. Overuse of the phrases \"Key takeaways\", \"In Conclusion\" and \"Action Steps\".\n3. Case studies it comes up with seem contrived and unbelievable. \n4. The writing seems generic and superficial.\n5. Chapters are set our wth too many bullet points,  numbered lists and sub-headings.\n\nIf Gemini or yhe upgraded current models could fix these, that would be great."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430052,
                    "id": "k52pt4k",
                    "parent_id": "t1_k52pnd9",
                    "author": "jamSpaceJackson2",
                    "score": 3,
                    "body": "Google is getting hit with antitrust laws rn. Might not be a great idea"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436214,
                    "id": "k52z8qt",
                    "parent_id": "t1_k52pnd9",
                    "author": "Ok-Mess-5085",
                    "score": 1,
                    "body": "I'm going to short it."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430354,
                    "id": "k52qbev",
                    "parent_id": "t1_k52q3eg",
                    "author": "Curiosity_456",
                    "score": 15,
                    "body": "If you wanna get technical it was current openAI employees who actually invented the transformer they just ditched google because of the lack of respect lol."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697438367,
                    "id": "k5324te",
                    "parent_id": "t1_k52q3eg",
                    "author": "kindslayer",
                    "score": 2,
                    "body": "Can you elaborate this? What is a transformer?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434811,
                    "id": "k52x9kg",
                    "parent_id": "t1_k52q3eg",
                    "author": "fmai",
                    "score": 2,
                    "body": "What's the advantage of having invented the Transformer?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435466,
                    "id": "k52y777",
                    "parent_id": "t1_k52wgja",
                    "author": "Ion_GPT",
                    "score": 5,
                    "body": "Yes. For Google is a failure. Bard is a failure. I have self hosted models better than Bard. It is useless."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434975,
                    "id": "k52xhvt",
                    "parent_id": "t1_k52pltk",
                    "author": "SoupOrMan3",
                    "score": 0,
                    "body": "It’s called not being 16 and having all the time in the world to focus on technology which for all they know, it’s just like the next iPhone as important."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697431322,
                    "id": "k52rx6g",
                    "parent_id": "t1_k52pml3",
                    "author": "Nervous-Newt848",
                    "score": 2,
                    "body": "Who said?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435961,
                    "id": "k52yw45",
                    "parent_id": "t1_k52q7z6",
                    "author": "cosmonaut_tuanomsoc",
                    "score": 1,
                    "body": "Yes, but from the other side, it's a very difficult situation for them. AI disrupts search engine business - it affects directly revenue from ads, as it reduces usage of classic search engines. It's extinction level threat, but again, Google is in very difficult position."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434105,
                    "id": "k52w8o0",
                    "parent_id": "t1_k52nxje",
                    "author": "Humble_Personality73",
                    "score": 1,
                    "body": "Let me guess through Jesus alone 🙄  😱 . No preaching allowed 😤"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435664,
                    "id": "k52yhb0",
                    "parent_id": "t1_k52qtlo",
                    "author": "Ion_GPT",
                    "score": 1,
                    "body": "I will for my specific niches. I already have thousands of prompts in gpt4, I know where it impressed me and where it struggled. I will just try those prompts"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697428171,
                    "id": "k52mfr1",
                    "parent_id": "t1_k52kn72",
                    "author": "sidspodcast",
                    "score": 4,
                    "body": "smartphone wtih 4k cameras become obsolete in a year. Things move fast.   \n\n\nBARD maybe only 6 months old but already dead. It was dead at arrival."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697425127,
                    "id": "k52g8is",
                    "parent_id": "t1_k52fy4m",
                    "author": "WokeAssBaller",
                    "score": 6,
                    "body": "Google is rolling it out to select partners"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434527,
                    "id": "k52wuwo",
                    "parent_id": "t1_k52pywn",
                    "author": "WosIsn",
                    "score": 2,
                    "body": "With respect to"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427909,
                    "id": "k52lxbv",
                    "parent_id": "t1_k52j96i",
                    "author": "Prestigious_Ebb_1767",
                    "score": 3,
                    "body": "Tend to agree. Hard to imagine the open source’ish models staying in the same solar system with foundational models continuing to scale out with massive compute. Hope I’m wrong though!"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697428344,
                    "id": "k52mrrd",
                    "parent_id": "t1_k52j96i",
                    "author": "IslSinGuy974",
                    "score": 3,
                    "body": "Yes but Meta said they'll begin training Llama 3 early 2024 and it's set to be on par with gpt-4."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436414,
                    "id": "k52ziy6",
                    "parent_id": "t1_k52l1p4",
                    "author": "tinny66666",
                    "score": 1,
                    "body": "Meta doesn't have talent?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427920,
                    "id": "k52ly43",
                    "parent_id": "t1_k52ig6p",
                    "author": "aue_sum",
                    "score": -1,
                    "body": "lol. Y'all will be feeling so disappointed when 2030 rolls around and the sota is only that bit better than today. It might even decrease given the regulations which might come around."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697433814,
                    "id": "k52vt55",
                    "parent_id": "t1_k52svmi",
                    "author": "ToothlessGrandma",
                    "score": 6,
                    "body": "And you'll pay for it anyways, because there's no other video streaming site that comes anywhere near YouTube."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435293,
                    "id": "k52xy6c",
                    "parent_id": "t1_k52ismz",
                    "author": "Ion_GPT",
                    "score": 1,
                    "body": "Gpt4 can solve more than 50% of hard problems with multiple steps (keep feeding the errors back)"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435341,
                    "id": "k52y0la",
                    "parent_id": "t1_k52w0m2",
                    "author": "Ion_GPT",
                    "score": 2,
                    "body": "That is the corporate language."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434226,
                    "id": "k52wf0b",
                    "parent_id": "t1_k52pt4k",
                    "author": "faux_something",
                    "score": 4,
                    "body": "Buy high, sell high"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697439227,
                    "id": "k5338z6",
                    "parent_id": "t1_k52qbev",
                    "author": "clow-reed",
                    "score": 1,
                    "body": "Which current openAi employee invented the transformer?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697439461,
                    "id": "k533jid",
                    "parent_id": "t1_k5324te",
                    "author": "Zulfiqaar",
                    "score": 1,
                    "body": "GPT stands for Generative Pretrained Transformer, it's the architecture behind modern Large Language Models"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435045,
                    "id": "k52xlfg",
                    "parent_id": "t1_k52x9kg",
                    "author": "SoupOrMan3",
                    "score": 5,
                    "body": "Having good scientists."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697432620,
                    "id": "k52tzdz",
                    "parent_id": "t1_k52rx6g",
                    "author": "Iamreason",
                    "score": 5,
                    "body": "Google did.  They said it will launch this Fall.\n\nAs to GPT-5 not being trained Altman said they have no plans to train a larger model under oath for the next 6 months back in June.  https://lifearchitect.ai/gpt-5/"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697429478,
                    "id": "k52otxe",
                    "parent_id": "t1_k52mfr1",
                    "author": "Christosconst",
                    "score": 1,
                    "body": "By OPs logic, Bard is 6 months new tech. And Google was overhyping it too"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697437016,
                    "id": "k530cm8",
                    "parent_id": "t1_k52lxbv",
                    "author": "visarga",
                    "score": 1,
                    "body": "I can imagine it if they train the small models with a huge corpus of filtered and refined synthetic data. There is at least a 5x boost from synthetic data, maybe more - meaning models 5x smaller perform as well when trained on it compared to regular organic text."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697428771,
                    "id": "k52nkhe",
                    "parent_id": "t1_k52ly43",
                    "author": "apoca-ears",
                    "score": 1,
                    "body": "I don’t think anyone knowledgeable about the sota is saying this at all. Can you give any examples if so?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434864,
                    "id": "k52xca9",
                    "parent_id": "t1_k52vt55",
                    "author": "SoupOrMan3",
                    "score": 2,
                    "body": "Yet"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435877,
                    "id": "k52yrxh",
                    "parent_id": "t1_k52xlfg",
                    "author": "visarga",
                    "score": 5,
                    "body": "no longer, they all left Google\n\nalmost all transformer original authors have their own startups"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436064,
                    "id": "k52z1b5",
                    "parent_id": "t1_k52xlfg",
                    "author": "fmai",
                    "score": 1,
                    "body": "I agree that Google has many good scientists and engineers, but many of the Transformer paper authors specifically have already left.\n\nWe could just say directly that Google has a giant talent pool."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434192,
                    "id": "k52wd82",
                    "parent_id": "t1_k52tzdz",
                    "author": "HappyCamperPC",
                    "score": 4,
                    "body": "Nothing to stop them releasing ChatGPT 4.1 though."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697438136,
                    "id": "k531txq",
                    "parent_id": "t1_k52tzdz",
                    "author": "Nervous-Newt848",
                    "score": 2,
                    "body": "That's not what the great Jimmy Apples foretold"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697433152,
                    "id": "k52usu7",
                    "parent_id": "t1_k52otxe",
                    "author": "Ordowix",
                    "score": 3,
                    "body": "Bard was overhyped. It's balls"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436294,
                    "id": "k52zcr6",
                    "parent_id": "t1_k52xca9",
                    "author": "ToothlessGrandma",
                    "score": 2,
                    "body": "YouTube has dominated the world for over 15 years. Unlikely it's going to change anytime soon."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697433777,
                    "id": "k52vr4j",
                    "parent_id": "t1_k52usu7",
                    "author": "sidspodcast",
                    "score": 1,
                    "body": "Google has been lowballing us forsometime. They clearly have the technology to blow our minds way but they do not want to give that out.  \n\n\nThey have been giving us half ass products like BARD thinking it will satiate the public and they will get away.  \n\n\nGPT-4 pushed them enough, so now they have no option but to come up with Gemini. If it were not for Open-AI, we would had never got the real good stuff."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436378,
                    "id": "k52zh30",
                    "parent_id": "t1_k52zcr6",
                    "author": "jeditech23",
                    "score": 1,
                    "body": "Empires come and go\n\nThere are people that are smarter than you and I that get paid mucho big bucks to analyze just how much people will get pushed until they leave the platform"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434164,
                    "id": "k52wbqc",
                    "parent_id": "t1_k52vr4j",
                    "author": "Ordowix",
                    "score": 3,
                    "body": "clearly? no. just because they're big doesn't mean anything. Actions speak. Market Cap doesn't"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436151,
                    "id": "k52z5ln",
                    "parent_id": "t1_k52vr4j",
                    "author": "visarga",
                    "score": 1,
                    "body": "And it's not the first time, Google gave us sub-par AI for years\n\n- Google Translate << DeepL\n\n- Google Image based search << Yandex Image\n\n- Google OCR << Amazon Textract\n\n- Google Search (now) << Google Search in 2010\n\n- Google Assistant  - is just bad\n\n- TensorFlow << PyTorch\n\nAnd these are the products they didn't rush to kill, like G+ and others. There is disfunctionality in Google, something rotten. Maybe their incentive structure doesn't work anymore since 2010. During COVID they have been racking up more profits than ever, it might have something to do with conflicting short and long term strategy. \"Why mess with perfect?\""
                }
            ]
        },
        {
            "py/object": "module_1.redder.post",
            "creationTime": 1697417827,
            "id": "178twtz",
            "author": "adt",
            "title": "AGI achieved internally: A re-written story (Life 3.0 annotated, with replacements for the Omegas and Prometheus)",
            "body": "",
            "score": 28,
            "upvoteRatio": 0.8,
            "comments": [
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697417878,
                    "id": "k51zs1o",
                    "parent_id": null,
                    "author": "adt",
                    "score": 7,
                    "body": "Had a bit of fun with this this morning. Thanks to GPT-4 for writing the JavaScript and making me feel like I can still code :-/\n\nMax's 2017 book is here:\n\n[https://www.amazon.com/dp/1101970316](https://www.amazon.com/dp/1101970316)"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697419392,
                    "id": "k5238vv",
                    "parent_id": null,
                    "author": "Ok-Worth7977",
                    "score": 8,
                    "body": "If it was really achieved, they would skyrocket in a month"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697420161,
                    "id": "k5250fh",
                    "parent_id": null,
                    "author": "coolguy69420xo",
                    "score": 4,
                    "body": "Alan! Great stuff. I was randomly thinking about how your gentle theatre voice gives me nostalgia for growing up in the late 90's as a kid watching playschool.\n\nOnwards to the future!"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434720,
                    "id": "k52x4xq",
                    "parent_id": null,
                    "author": "Worldly_Evidence9113",
                    "score": 1,
                    "body": "You can forget GPT-5"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697437195,
                    "id": "k530l6o",
                    "parent_id": null,
                    "author": "on-ap",
                    "score": 1,
                    "body": "Probably read this Prelude five times already. I love this story."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697419990,
                    "id": "k524mde",
                    "parent_id": "t1_k5238vv",
                    "author": "RemyVonLion",
                    "score": 11,
                    "body": "I can possibly believe the take that they almost have weak*-AGI, as in it can do most human tasks, but possibly due to censorship and intentional limitations, it might not be human level consciousness in all ways."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697423119,
                    "id": "k52bumw",
                    "parent_id": "t1_k5238vv",
                    "author": "BeginningInfluence55",
                    "score": 4,
                    "body": "AGI can do what a median human can do. AGI ≠ ASI \n\nGPT-4 is 1.5 years old. Bet they made some serious progress since then."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697432605,
                    "id": "k52tykj",
                    "parent_id": "t1_k5238vv",
                    "author": "linebell",
                    "score": 1,
                    "body": "Who/what would skyrocket? You mean like this?\n\nhttps://preview.redd.it/1vjcm3qlyhub1.jpeg?width=1170&format=pjpg&auto=webp&s=b7045808a30ece2d2bb43b7b02641a16c8ce26e6"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697423113,
                    "id": "k52bu5q",
                    "parent_id": "t1_k524mde",
                    "author": "sdmat",
                    "score": 6,
                    "body": "> narrow-AGI\n\nTo avoid the oxymoron we generally go with weak AGI"
                }
            ]
        },
        {
            "py/object": "module_1.redder.post",
            "creationTime": 1697412981,
            "id": "178sbe4",
            "author": "xSNYPSx",
            "title": "How many flops do you think is needed to reach human level AGI? I also realized that we are growing at about 10x per year, which means that 2 years before AGI our best model will be only 1% the size of the theoretical AGI model.",
            "body": "",
            "score": 75,
            "upvoteRatio": 0.91,
            "comments": [
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415137,
                    "id": "k51teo6",
                    "parent_id": null,
                    "author": "inteblio",
                    "score": 46,
                    "body": "it's design\n\nAssuming humans posses a similar flops capacity (same brain size) it's the layout/networking of it that makes the difference. It seems obvious that the current design of AI is extremely inefficient, and so our flops are way ahead of the potential intelligence at this flop-level. Also, humans are crazy inefficient (they go to buy milk, sleep, and socialise) so flop-for-flop the AI have the advantage. It's worth noting that GPT4 can blam out an essay in seconds, that most people can't write to save their lives."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414473,
                    "id": "k51rvbi",
                    "parent_id": null,
                    "author": "aue_sum",
                    "score": 9,
                    "body": "notice the logarithmic curve"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697417467,
                    "id": "k51yto8",
                    "parent_id": null,
                    "author": "Major-Rip6116",
                    "score": 7,
                    "body": "Perhaps the first AGI will be an inefficient \"fatty\" size. From there it will go on a diet and become a slender AGI; I would expect that even the size of GPT4 would be a size that would be considered fat from the point of view of a smart AGI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697417559,
                    "id": "k51z1bw",
                    "parent_id": null,
                    "author": "chillinewman",
                    "score": 4,
                    "body": "2 to 5 years to AGI could be in the realm of possibility."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415078,
                    "id": "k51t9rl",
                    "parent_id": null,
                    "author": "ertgbnm",
                    "score": 7,
                    "body": "Model SIZES are not growing at 10X per year. Training run compute might be but that's entirely different. GPT-3 is about 150B parameters. GPT-4 is rumored to be a 4X200B Mixture of Experts model and it came out almost 3 years later. \n\n\nSo it's closer to double every year or so."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697416555,
                    "id": "k51wpal",
                    "parent_id": null,
                    "author": "AsheyDS",
                    "score": 2,
                    "body": "Hopefully 32pflops (fp8) or less."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697418433,
                    "id": "k5212dl",
                    "parent_id": null,
                    "author": "HomelessSantaClaus",
                    "score": 2,
                    "body": "At least two, given how fucking stupid my brother in law is."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697421774,
                    "id": "k528rui",
                    "parent_id": null,
                    "author": "Poly_and_RA",
                    "score": 2,
                    "body": "I think it's unlikely that simply adding more compute will necessarily get us there at all. Most models have rapidly diminishing returns so that after a given point, adding more compute-power does very limited, if any, good -- you need improvements to software to progress further.\n\nFaster isn't by itself automatically smarter.\n\nDall-E can draw pictures better than 99.9% of human beings in \\~5 seconds, but multiply the power by 10000 by the simply expedient of allowing it to calculate for 16 hours instead -- and you don't get images that are orders of magnitude better.\n\nAlso, the large gains in compute-power at the moment are because of increased investments, combined with some low-hanging fruit. Progress in chip-speed isn't anywhere near 10x per year, instead it's in the viscinity of +40% (i.e. a doubling every 2 years) give or take a bit."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697418622,
                    "id": "k521hpn",
                    "parent_id": null,
                    "author": "ArgentStonecutter",
                    "score": 0,
                    "body": "I think we have to work on the algorithms because no number of flops can produce AGI before that gets worked out.\n\nAlso, no, it’s not growing 10x a year."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697417615,
                    "id": "k51z61i",
                    "parent_id": null,
                    "author": "InternationalEgg9223",
                    "score": 1,
                    "body": "One way to get to 10 orders of magnitude bigger than GPT-4 is to reach 100 teraflops per watt, current processors are at about 1 teraflops per watt, and energy consumption of a large country and training time of a few years. I'm quite confident it would do it."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430031,
                    "id": "k52prst",
                    "parent_id": null,
                    "author": "JavaMochaNeuroCam",
                    "score": 1,
                    "body": "1 exaflop is equivalent to a human brain. ( exists already )\n\nBut, it's safe to say that a purely thinking machine needs far far less since it doesn't need to process massive sensory input nor maintain proprioceptive models."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430096,
                    "id": "k52pvt2",
                    "parent_id": null,
                    "author": "crashtested97",
                    "score": 1,
                    "body": "Just wondering, where are you able to compile this data from?\n\nEdit: I see, this is the combined total number of floating point operations used to train each model. At first glance I thought it was the total number of flop/s (ops per second) of all the computers training AI models. I'd really love to know what that graph looks like."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697433204,
                    "id": "k52uvmj",
                    "parent_id": null,
                    "author": "IronPheasant",
                    "score": 1,
                    "body": "A useful way of thinking about this, I feel, is in terms of what faculties a roughly-human level AGI would need. Words are nice to have. Other stuff would be nice to have as well - you shouldn't try to use a fork to eat soup with. Animal brains are a mesh of different interconnected kinds of intelligence, so that's probably feasible, right? Your motor cortex doesn't have thoughts or feelings or \"consciousness\" but it's hella helpful to have around.\n\nHow much of this stuff requires a neural network and how much of it can be performed by regular simple computer software, eh.\n\nMy gut says you can start getting something animal-like with a gestalt model around five times the size of GPT-4. And something human-like between there and twenty times. And fairly confident ~100x times the size must certainly be enough."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436159,
                    "id": "k52z5y2",
                    "parent_id": null,
                    "author": "deavidsedice",
                    "score": 1,
                    "body": "A sustained 10X growth per year isn't possible. Up to now it has been because it was a new field, new things to try and we started very small and we've been scaling as much as possible.\n\nHowever this trend ends now with Gemini. We don't have enough hardware and it takes way too much time to train. Increasing it another 10X fold requires several years of training by using as many GPU as possible, therefore it cannot grow at that rate.\n\nI guess.... It can use even more GPUs in parallel. But at some point either we can't produce that many, or the energy cost or production cost isn't worth it anymore. And there are supply problems already for this hardware. I don't think it can take another 10X scaling without waiting for Moore's law to catch up."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697438036,
                    "id": "k531p8p",
                    "parent_id": null,
                    "author": "Alberto_the_Bear",
                    "score": 1,
                    "body": "I've the human brain performs the equivalent of 1 exaflop per second. That's  10\\^18 flops. Once a computer with that much power can have it's network architecture fine tuned, it should be easy to reach AGI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415573,
                    "id": "k51uf6g",
                    "parent_id": "t1_k51teo6",
                    "author": "Odd-Explanation-4632",
                    "score": 26,
                    "body": "We also don't need to emulate the entire brain. A lot of the brain is dedicated to things that computers don't need to worry about. Maybe we only need like 20% of the brain to actually be emulated"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697418003,
                    "id": "k5202ky",
                    "parent_id": "t1_k51teo6",
                    "author": "Smooth-Ad1721",
                    "score": 8,
                    "body": "There are individuals that behave pretty typically while having half a brain (one hemisphere). **This is probably a gross oversimplification** but I wonder if that means that you can get away with half the amount of parameters (50 times more than GPT-4) assuming that backprop or something else don't give the edge.\n\nThe brain has redundancy across an axis of symmetry. If you can remove one hemisphere but you cannot cut the brain across any other axis while preserving functionality just as well, that means that the structures that each hemisphere has matter."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697419145,
                    "id": "k522ooc",
                    "parent_id": "t1_k51teo6",
                    "author": "maskedpaki",
                    "score": 3,
                    "body": "how quickly gpt4 takes to write an essay has 0 to do with how many flops were used to train it\n\nyou are conflating inference with training."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415189,
                    "id": "k51tizj",
                    "parent_id": "t1_k51rvbi",
                    "author": "maskedpaki",
                    "score": -8,
                    "body": "notice the tapering off on the curve because the training runs are costing too much.\n\n&#x200B;\n\nif we dont get AGI by Jan 1 2027 Im going to guess we end up with another ai winter seeing as algorithms are just not getting better quickly enough."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697416599,
                    "id": "k51wsww",
                    "parent_id": "t1_k51t9rl",
                    "author": "Economy_Variation365",
                    "score": 8,
                    "body": "I believe the OP was referring to the number of calculations used in the training (now as high as 10^25 ), not the number of parameters in the model."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697419224,
                    "id": "k522v4j",
                    "parent_id": "t1_k51t9rl",
                    "author": "maskedpaki",
                    "score": 4,
                    "body": "model size is irrelevant. training flops are a stronger predictor of capabilites than model size. we have seen tiny model outperform 100B parameter models."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697425740,
                    "id": "k52his9",
                    "parent_id": "t1_k528rui",
                    "author": "InternationalEgg9223",
                    "score": -1,
                    "body": "That's kind of like saying that we don't know whether billion years of evolution differs from thousand years of evolution. In short, it's quite dumb."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697432349,
                    "id": "k52tk2a",
                    "parent_id": "t1_k528rui",
                    "author": "IronPheasant",
                    "score": 1,
                    "body": "Parameters is maybe a better metric than raw flops. Flopping around only helps if you have enough space to grow the algorithms that actually do stuff.\n\nThe bitter lesson has been proven time and again - scale is completely necessary, and all the tricks to try to wiggle out of needing it have been useful only as temporary hacks. You can't build a human mind without enough RAM to hold a human mind."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697425885,
                    "id": "k52htte",
                    "parent_id": "t1_k521hpn",
                    "author": "InternationalEgg9223",
                    "score": 0,
                    "body": "We know it can produce AGI and we even have mathematical proof of it."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697421915,
                    "id": "k529461",
                    "parent_id": "t1_k521hpn",
                    "author": "n0nati0n",
                    "score": 1,
                    "body": "Ah yes, the algorithms! Let’s work on those."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427766,
                    "id": "k52ln8h",
                    "parent_id": "t1_k51uf6g",
                    "author": "Talkat",
                    "score": 5,
                    "body": "Well I agree and haven't thought about it.\n\nWe have very low level processes like keeping up breathing, regulating temp, hormones, etc with the 'lizard' part of our brains.\n\nAI runs on traditional software which has drivers, bios, etc. Perhaps that is their \"lizard\" brain and should be counted towards emulating the entire human brain?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430113,
                    "id": "k52pwrr",
                    "parent_id": "t1_k51uf6g",
                    "author": "outerspaceisalie",
                    "score": 3,
                    "body": "There are some arguments to be made that without those low lying processes or some equivalent, there is no context for intelligence to exist within in the first place"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697437959,
                    "id": "k531lmf",
                    "parent_id": "t1_k51uf6g",
                    "author": "CertainMiddle2382",
                    "score": 1,
                    "body": "IMO, the brain analogy has long passed.\n\nWe are well beyond understanding how it is working in its intricacies, and we are still far from it, with no adequate tools in the coming decades adequate (invivo large scale axone level electro biology)\n\nAI has moved passed neuro analogy 15 years and will never come back to it. IMHO again :-)"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697420315,
                    "id": "k525da0",
                    "parent_id": "t1_k5202ky",
                    "author": "SendMePicsOfCat",
                    "score": 7,
                    "body": "I want you to know I just googled this because I was bone deep convinced you were making stuff up. Absolutely boggling that you can take away a full half of what makes a person, and still have a full person, pretty functional. Then again, given split brain studies, I'd argue that a more literal chunk of your \"self\" and \"person\" did die in the removal. It's so fascinating how much consciousness and personhood are just the emergent effects of our brains. I guess I'd compare it to being like a UI running on a computer, nowhere near the actual binary code, but still running on it."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415285,
                    "id": "k51tqzb",
                    "parent_id": "t1_k51tizj",
                    "author": "skinnnnner",
                    "score": 9,
                    "body": "There is no tapering off. This graph has way too few data points. There are many other companies."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697416837,
                    "id": "k51xd2z",
                    "parent_id": "t1_k51wsww",
                    "author": "ertgbnm",
                    "score": 1,
                    "body": ">which means that 2 years before AGI our best model will be only 1% the size of the theoretical AGI model.\n\nI was just responding to the way OP worded it. Size != Compute."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697429758,
                    "id": "k52pb8w",
                    "parent_id": "t1_k52htte",
                    "author": "jlpt1591",
                    "score": 2,
                    "body": "Source?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435508,
                    "id": "k52y9dm",
                    "parent_id": "t1_k52htte",
                    "author": "ArgentStonecutter",
                    "score": 1,
                    "body": "\"It\"?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697430192,
                    "id": "k52q1kr",
                    "parent_id": "t1_k52pwrr",
                    "author": "Odd-Explanation-4632",
                    "score": 3,
                    "body": "Can you truly be conscious if you don't fart 🤔🤔🤔"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697420542,
                    "id": "k525w7h",
                    "parent_id": "t1_k525da0",
                    "author": "apoca-ears",
                    "score": 5,
                    "body": "https://www.sciencealert.com/watch-you-are-actually-two-brains-living-in-one-person"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415854,
                    "id": "k51v2o8",
                    "parent_id": "t1_k51tqzb",
                    "author": "aue_sum",
                    "score": -3,
                    "body": "it's obviously tapering off"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415340,
                    "id": "k51tvon",
                    "parent_id": "t1_k51tqzb",
                    "author": "maskedpaki",
                    "score": -3,
                    "body": "none of those companies used more flops than gpt4 so yes it is tapering off. the tapering off would look even more dramatic if you include all the models weaker than gpt4"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697418314,
                    "id": "k520sez",
                    "parent_id": "t1_k51xd2z",
                    "author": "xSNYPSx",
                    "score": 1,
                    "body": "Fine"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697439361,
                    "id": "k533f1a",
                    "parent_id": "t1_k52q1kr",
                    "author": "outerspaceisalie",
                    "score": 1,
                    "body": "unlikely"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697420601,
                    "id": "k52611j",
                    "parent_id": "t1_k525w7h",
                    "author": "SendMePicsOfCat",
                    "score": 6,
                    "body": "That's exactly what I'm talking about. It's genuinely the coolest, and most horrifying thing to think about."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697426021,
                    "id": "k52i3zl",
                    "parent_id": "t1_k51v2o8",
                    "author": "Phoenix5869",
                    "score": -4,
                    "body": "Yep, it sucks but it looks like i was right. Things are indeed beginning to level off."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697416782,
                    "id": "k51x8f7",
                    "parent_id": "t1_k51tvon",
                    "author": "Rofel_Wodring",
                    "score": 6,
                    "body": ">none of those companies used more flops than gpt4 so yes it is tapering off.\n\nDo you guys need a refresher on how capitalism works? That's like judging the progression of the film industry by Edison Production's profitability and film catalogue in 1905 -- before giants like Paramount even entered the arena."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697427818,
                    "id": "k52lqwe",
                    "parent_id": "t1_k520sez",
                    "author": "Talkat",
                    "score": 2,
                    "body": "Fineeee"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697422781,
                    "id": "k52b3an",
                    "parent_id": "t1_k52611j",
                    "author": "Nanaki_TV",
                    "score": 3,
                    "body": "I’m with you dude. For a lot of my childhood it felt like I was the other brain and not in control. My therapist called it disassociation disorder for past trauma. I called it my evil self and took back control. God damn does this post sound schizophrenic but I have a 101 fever right now so I am not explain myself right."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697418957,
                    "id": "k52294z",
                    "parent_id": "t1_k51x8f7",
                    "author": "maskedpaki",
                    "score": 3,
                    "body": "I have no idea what you are even talking about. Im saying that if you open your eyes and look at the graph you can see recent growth is lower than old growth.\n\nThe reason I dont see growth continuing is because its being driven by bigger budgets and not compute innovation and you cant increase budgets forever. Im even open to the idea that this might change and we see compute innovation suddenly explode. What part of this is remotely disagreeable ?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697419499,
                    "id": "k523hwl",
                    "parent_id": "t1_k52294z",
                    "author": "Rofel_Wodring",
                    "score": 4,
                    "body": ">The reason I dont see growth continuing is because its being driven by bigger budgets and not compute innovation and you cant increase budgets forever.\n\nAnd here's the best part. The underlying hardware (to speak nothing of genuine innovations on the horizon, like photonics and quantum computing) becomes more capable over time regardless of advances in AI. Meaning that for the same budget you passively get more performance.\n\nThere's a reason why no other industry has an internal growth factor even comparable to Moore's Law."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697420382,
                    "id": "k525iwr",
                    "parent_id": "t1_k523hwl",
                    "author": "maskedpaki",
                    "score": 2,
                    "body": "The graph above is far higher than Moore's law\n\nIf you mean 2x per year then I'm onboard with Moore's law \n\nBut 10x is driven primarily by throwing more money at the problem"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697422096,
                    "id": "k529jh0",
                    "parent_id": "t1_k525iwr",
                    "author": "Rofel_Wodring",
                    "score": 1,
                    "body": "You also said this:\n\n>The reason I dont see growth continuing is because its being driven by bigger budgets and not compute innovation and you cant increase budgets forever.\n\nIf you meant 'I don't see growth continuing at the same breakneck pace', well, fine, but you said that growth couldn't continue because it was limited by some X-factor that budget couldn't overcome."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697422541,
                    "id": "k52ak0p",
                    "parent_id": "t1_k529jh0",
                    "author": "maskedpaki",
                    "score": 2,
                    "body": "I meant the 10x compute growth per year driven by budgets.\n\nI guess we could see 40% per year instead of 900% based on Moore's law but that's almost 0 compared to the growth we've seen these last 5 years.\n\nBy the way I'm actually hoping that you are right on this."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697426052,
                    "id": "k52i6ab",
                    "parent_id": "t1_k529jh0",
                    "author": "InternationalEgg9223",
                    "score": 2,
                    "body": "Moore's Meme has conditioned many to think that either computers get better or they don't, on or off."
                }
            ]
        },
        {
            "py/object": "module_1.redder.post",
            "creationTime": 1697406484,
            "id": "178q18r",
            "author": "SpaceBrigadeVHS",
            "title": "21-Year-Old Wins $40K After Using AI to Read First Word on 2,000-Year-Old Papyrus Scroll",
            "body": "",
            "score": 399,
            "upvoteRatio": 0.98,
            "comments": [
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414206,
                    "id": "k51r9bl",
                    "parent_id": null,
                    "author": "lopgir",
                    "score": 112,
                    "body": "VERY exciting when you consider  the sheer size of the library. We could be getting so, so many Greek and Roman works that were thought lost back."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697406957,
                    "id": "k519whs",
                    "parent_id": null,
                    "author": "SpaceBrigadeVHS",
                    "score": 74,
                    "body": "\"The competition winner, who is a student at the University of Nebraska–Lincoln, was inspired by the previous work of another contestant, Casey Handmer, which followed on from research by Professor Brent Seales at the University of Kentucky’s EduceLab, according to the Vesuvius Challenge website. Per Nature, Farritor developed a machine-learning algorithm which he used to eventually detect a number of letters on the scroll. The word he discovered was \"Porphyras\" which means \"purple\" the Vesuvius Challenge website said.\""
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697407472,
                    "id": "k51b68j",
                    "parent_id": null,
                    "author": "AhabJL",
                    "score": 35,
                    "body": "That alot of money"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697431731,
                    "id": "k52skyd",
                    "parent_id": null,
                    "author": "furrypony2718",
                    "score": 9,
                    "body": "Some technical details:\n\n \n\n>... text inside a carbonized scroll from the ancient Roman city of Herculaneum, which had been unreadable since a volcanic eruption in AD 79 — the same one that buried nearby Pompeii... The Herculaneum library contains works not known from any other sources, direct from the authors.  \nmore than 600 scrolls — most held in the National Library in Naples, with a handful in the United Kingdom and France — remain intact and unopened. And more papyri could still be found on lower floors of the villa, which have yet to be excavated.  \n>  \n>Farritor used subtle, small-scale differences in surface texture to train his neural network and highlight the ink.   \n>  \n> The Vesuvius Challenge offers a series of awards, leading to a main prize of US$700,000 for reading four or more passages from a rolled-up scroll.   \nFarritor has won the ‘first letters’ prize of $40,000 for reading more than 10 characters in a 4-square-centimetre area of papyrus. \n\nPrevious work (2016):\n\n> charred scroll from En-Gedi in Israel, revealing sections of the Book of Leviticus written in the third or fourth century AD. But the ink on the En-Gedi scroll contains metal, so it glows brightly on the CT scans. The ink on the older Herculaneum scrolls is carbon-based, essentially charcoal and water, with the same density in scans as the papyrus it sits on, so it doesn’t show up at all.\n> Seales realized that even with no difference in brightness, CT scans might capture tiny differences in texture that can distinguish areas of papyrus coated with ink. To prove it, he trained an artificial neural network to read letters in X-ray images of opened Herculaneum fragments."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697431793,
                    "id": "k52soh3",
                    "parent_id": null,
                    "author": "ROSCOEMAN",
                    "score": 13,
                    "body": "r/art gonna cry about this somehow"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697410926,
                    "id": "k51jfpe",
                    "parent_id": null,
                    "author": "Bacon44444",
                    "score": 13,
                    "body": "What was the word?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697411764,
                    "id": "k51lfoc",
                    "parent_id": null,
                    "author": "carmikaze",
                    "score": 24,
                    "body": "I don't get it. Why not scan it and simply read the letters. What's the ai for?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697428585,
                    "id": "k52n85t",
                    "parent_id": null,
                    "author": "Rabbit_Crocs",
                    "score": 3,
                    "body": "Congrats 🍾 pretty cool"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697431007,
                    "id": "k52rei5",
                    "parent_id": null,
                    "author": "halloween_fan94",
                    "score": 2,
                    "body": "very nice."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697439824,
                    "id": "k53404s",
                    "parent_id": null,
                    "author": "Asocial_Stoner",
                    "score": 1,
                    "body": "Pretty wild, though I would have liked some more technical details, does anyone have a link to his paper / thesis or whatever?\n\nEDIT: Ok, they link to a better article: https://scrollprize.org/firstletters"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697418655,
                    "id": "k521kdj",
                    "parent_id": "t1_k51r9bl",
                    "author": "BluePhoenix1407",
                    "score": 41,
                    "body": "As someone who has been following the news on this project, it's very satisfying to finally see this breakthrough. A few hundred papyri remain unrolled and complete, and then there's the unexcavated area."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424974,
                    "id": "k52fwel",
                    "parent_id": "t1_k51b68j",
                    "author": "QuantumTyping33",
                    "score": -28,
                    "body": "eh"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697431793,
                    "id": "k52sogy",
                    "parent_id": "t1_k52skyd",
                    "author": "SpaceBrigadeVHS",
                    "score": 4,
                    "body": "Much appreciated."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697431890,
                    "id": "k52su6v",
                    "parent_id": "t1_k52soh3",
                    "author": "SpaceBrigadeVHS",
                    "score": 8,
                    "body": "Are they anti AI work flows over there?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697411444,
                    "id": "k51koik",
                    "parent_id": "t1_k51jfpe",
                    "author": "uosdef",
                    "score": 28,
                    "body": "Purple."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697413144,
                    "id": "k51orjj",
                    "parent_id": "t1_k51lfoc",
                    "author": "Quintium",
                    "score": 100,
                    "body": "The scrolls were carbonized by a vulcanic eruption, so the text is completely unreadable. What they do instead is create a precise x-ray scan of the scroll so that it can be virtually unrolled and the properties of the carbon analyzed (using machine learning), so that the ink can be recognized.\n\nThe image you see in the article is what the winner actually submitted, not what was given as the challenge.\n\nMore info here: https://scrollprize.org/"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434637,
                    "id": "k52x0pw",
                    "parent_id": "t1_k521kdj",
                    "author": "MegavirusOfDoom",
                    "score": 3,
                    "body": "No need to unroll them we can scan using x ray aligned in an accelerator."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697429078,
                    "id": "k52o4hr",
                    "parent_id": "t1_k52fwel",
                    "author": "tripleBBxD",
                    "score": 16,
                    "body": "The world average income per capita is around 12000$ to 18000$, so that's 2-3 Years of income for the average human. It is in fact a lot of money,"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436769,
                    "id": "k5300pc",
                    "parent_id": "t1_k52su6v",
                    "author": "Hazzman",
                    "score": 2,
                    "body": "I'm a professional artist. If you talk to most artists they will tell you they have nothing against AI in principle. A lot of artists issue with AI is very specific. Stop using publicly sourced, non-profit research lab acquired data to train your for profit software, which uses our work and threatens our livelihood. \n\nThat's pretty much the be all and end all of it - and I think that's perfectly fair.\n\nYou speak to any artist about AI being used to help translate thousands of years old text and very few if any are not gonna be impressed and or celebrate it."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697421780,
                    "id": "k528sde",
                    "parent_id": "t1_k51orjj",
                    "author": "camatthew88",
                    "score": 12,
                    "body": "That's really interesting"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697432177,
                    "id": "k52tagr",
                    "parent_id": "t1_k51orjj",
                    "author": "SpaceBrigadeVHS",
                    "score": 6,
                    "body": "Excellent comment. Thank you."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697439692,
                    "id": "k533u3l",
                    "parent_id": "t1_k52x0pw",
                    "author": "worldburger",
                    "score": 1,
                    "body": "Wait what? ELI5 pls 🫨"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697435391,
                    "id": "k52y39u",
                    "parent_id": "t1_k52o4hr",
                    "author": "QuantumTyping33",
                    "score": -13,
                    "body": "aim higher"
                }
            ]
        },
        {
            "py/object": "module_1.redder.post",
            "creationTime": 1697400712,
            "id": "178nvvh",
            "author": "Weary_Dark510",
            "title": "Every day adoption grows",
            "body": "This sub is full of posts about what will happen when AI and technology leapfrogs out of our control. Today I would like to check in on the current status of progress, and adoption. I overheard my wife’s meeting yesterday, and someone said “I’ve been experimenting with using chat gpt to help me with documentation” or something along those lines. I also know a lot of children and college students use gpt to do most of their homework. \n\nI’m curious, what are some ways you have seen/heard people use, or used gpt yourself in everyday life? What is the most inspiring thing ai can do now, and what is the scariest thing it can do now?",
            "score": 25,
            "upvoteRatio": 0.88,
            "comments": [
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697403228,
                    "id": "k5102oz",
                    "parent_id": null,
                    "author": "chlebseby",
                    "score": 25,
                    "body": "Wait a year or two and use will explode.\n\nSo far most people i know either use AI models as novelty or not at all. Understable, in current form its not very useful for them. Its still very specific tech, like early internet.\n\nChatGPT is most accessible so far, but its game changing only if you work with text or code daily. Personal assistant style models and easy UI's will make AI revolution."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697401175,
                    "id": "k50udtj",
                    "parent_id": null,
                    "author": "SgathTriallair",
                    "score": 14,
                    "body": "My work (we do online education courses for adults) has adopted an official ChatGPT policy for our writing staff, specifically how they are allowed to use it, and we are switching entirely to AI created videos, from Synthesia.\n\nI also use GPT-4 Advanced Data Analysis to help me with spreadsheets and data crunching quite frequently."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697401294,
                    "id": "k50upek",
                    "parent_id": null,
                    "author": "Jean-Porte",
                    "score": 12,
                    "body": "I teach Msc students (computer science exercise sessions) and \\~10% of them are using it in front of me. Half have the pro version."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697406051,
                    "id": "k517lwf",
                    "parent_id": null,
                    "author": "Rofel_Wodring",
                    "score": 7,
                    "body": "I used it to help guide me through installing and emulating Unix-based MUD server on my Windows 11 machine, to include editing headers and makefiles. Chocolatey, yo."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697417007,
                    "id": "k51xr8h",
                    "parent_id": null,
                    "author": "raicorreia",
                    "score": 3,
                    "body": "I use gpt and several other AIs daily and as a software engineer even they fail a lot I see as a great source of inspiration and on where to start looking for on the debug process, but adoption will raise way more in the next few years, because I work for a small consulting company and most people still do not use AI or don't use much, I'm still the \"one who knows how to use AI\" among them."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697418557,
                    "id": "k521cgm",
                    "parent_id": null,
                    "author": "BLHero",
                    "score": 3,
                    "body": "Community building.  For example, in a math class:\n\n1. During the first week of class, students ask an AI to describe one student who likes math, and another student who is afraid of math.  (If desired, add a few adjectives to increase resemblance.)  Students share which prompts they used, and then compare and contrast how they are similar and different to the two imagined students.\n\n2. Students ask an AI how math could be used in a future job, and ask for recommendation of one or two books about that type of in-the-workplace math.\n\n3. When the class is about to start a new topic, students ask an AI to break down that topic into subtopics and lessons.  How do the results compare to each other, and the actual class syllabus?  What do we learn from the discrepancies?\n\n4. Students pick a math subtopic that in the past has been their nemesis, and ask an AI to explain that subtopic \"as if talking to...\" with various ways to complete that phrase.  Do any of those attempts help?\n\n5. For a given math topic, ask an AI about which questions students typically ask an instructor.  Then ask an AI about which questions an instructor typically ask students.  What do we learn from the similarities and differences in these AI responses?\n\n6. Students provide an AI with the list of class topics from the syllabus, and ask the AI to  find comparisons and contrasts among those topics.\n\n7. Students provide an AI with the list of class topics and subtopics from the syllabus, and ask the AI to create metaphors that might assist understanding some of these topics and subtopics.\n\n8. There are some famous stories about math topics, such as [the King's Chessboard](https://www.amazon.com/Kings-Chessboard-Picture-Puffin-Books/dp/0140548807), the [Barometer Problem](https://www.snopes.com/fact-check/the-barometer-problem/), and the John von Neumann story about [summing the series](https://www.pleacher.com/mp/mlessons/calculus/mobinfin.html).  For any of our class subtopics, can an AI either help students find a story, or create a worthy new story?\n\n9. Students ask an art AI application to create visual or audial artwork about our math subtopics.  Do any of these requests produce something worthwhile or insightful?\n\n10. Students ask an AI about study habits, test-taking strategies, or other meta-learning issues, and then reflect on the resultant advice."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697423319,
                    "id": "k52canq",
                    "parent_id": null,
                    "author": "Ambiwlans",
                    "score": 1,
                    "body": "Cheat on everything."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424785,
                    "id": "k52fi41",
                    "parent_id": null,
                    "author": "PrincessPiratePuppy",
                    "score": 1,
                    "body": "Scariest thing so far, dating site scams. Designed to pretend to be someone on a dating website and eventually elicit nudes, than it tries to black mail you."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697412537,
                    "id": "k51n9ii",
                    "parent_id": "t1_k50udtj",
                    "author": "Krommander",
                    "score": -4,
                    "body": "Oh wow it's really going to suck for the students! Why would they cut educators from educating?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697404905,
                    "id": "k514mqy",
                    "parent_id": "t1_k50upek",
                    "author": "V_Shtrum",
                    "score": 9,
                    "body": "We (students) are truly in a golden age: AI can write our assignments but unis haven't adapted yet."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436480,
                    "id": "k52zmbz",
                    "parent_id": "t1_k52fi41",
                    "author": "Progribbit",
                    "score": 1,
                    "body": "you can just say it's AI"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697412742,
                    "id": "k51nrwy",
                    "parent_id": "t1_k51n9ii",
                    "author": "SgathTriallair",
                    "score": 6,
                    "body": "I'm not sure what you mean.\n\nHumans are still writing the content and the scripts, with some help. We just aren't hiring actors, camera operators, lighting crew, and video editors anymore. The role of the instructor hasn't changed at all except we don't require them to be an actor (which is good because most sucked at it).\n\nThey also did an a/b test on AI videos versus human videos and our students prefer the AI videos."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697412683,
                    "id": "k51nmu4",
                    "parent_id": "t1_k514mqy",
                    "author": "Krommander",
                    "score": 4,
                    "body": "Next 10 years the perceived value of MSc and PhD diplomas will drop. Most scientific research done at that level is trivial with the kind of help gives ?"
                }
            ]
        },
        {
            "py/object": "module_1.redder.post",
            "creationTime": 1697382405,
            "id": "178hcv3",
            "author": "ziscz",
            "title": "Video: David Shapiro - AGI Within 12 Months. Rumors, Leaks, and Trends",
            "body": "David Shapiro gives an update on his previous prediction of AGI by September 2024. His timeline remains the same and he explains his reasoning in the video.",
            "score": 153,
            "upvoteRatio": 0.83,
            "comments": [
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697384402,
                    "id": "k4zl1sw",
                    "parent_id": null,
                    "author": "Gold_Cardiologist_46",
                    "score": 68,
                    "body": "David can do a lot of nuanced takes and I appreciate him for that, but the first part of the video is basically him using purported and misattributed leaks and rumours (it wasn't even Jimmy talking about Arrakis, it was FeltSeam) to validate his predictions."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697389215,
                    "id": "k4zxno9",
                    "parent_id": null,
                    "author": "HeinrichTheWolf_17",
                    "score": 35,
                    "body": "Oh boy, this is gonna be one hell of a comment section. \n\nAnyway, for all the people throwing out the ‘but what is AGI’ argument, in Shapiro’s last video he said that within 18 months *any definition you personally have about AGI* will be met. \n\nIf you agree with him or not on his timeline is another point entirely. He also thought GPT-4 was going to be underwhelming."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697409493,
                    "id": "k51g16n",
                    "parent_id": null,
                    "author": "n4ske",
                    "score": 9,
                    "body": "AGI is mostly a hardware problem and this video didn't touch on those developments, we have no reason to believe that general intelligence can be achieved with less synapses than the neocortex which is in the vicinity of 100-300 trillion, so before we begin to even speculate about the emergence of AGI we should be looking at the hardware to provide a general timeline\n\nEach synapse is 2 bytes plus some overhead so we are looking at when we will be training / inferencing on 300+TB models where the memory acts like a single huge chip, this has been the bottleneck for many years -- total available memory and bandwidth in a processing cluster -- not FLOPs as you can build clusters that have more than enough processing power for training, and if Nvidia's new supercomputer is ready in time for GPT5 then we will be at 150TB or just 1 hardware generation away from brain-scale models, also we can predict that GPT5 is going to be 10x more capable than Gemini because of the combined effect of HBM3E and a far superior unified memory network architecture\n\nSo considering the underlying hardware we are looking at 3 years to AGI, less if you believe that parameters in a model are more capable than synapses, more if you believe that multimodal LLMs aren't the right approach"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697400458,
                    "id": "k50se3v",
                    "parent_id": null,
                    "author": "spockphysics",
                    "score": 5,
                    "body": "I know everything in the universe, he’s right"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697410745,
                    "id": "k51j0b8",
                    "parent_id": null,
                    "author": "Cr4zko",
                    "score": 4,
                    "body": "I sure as hell hope so."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697385079,
                    "id": "k4zmtx6",
                    "parent_id": null,
                    "author": "RaccoonWound",
                    "score": 22,
                    "body": "I’m a big fan of David’s but I think even he doesn’t have a clear definition of what “AGI” actually is. None of us do and that’s the problem with predictions like this. Achieving AGI means different things to different people and I think we can probably all agree it’s a spectrum, not a binary trait that exists or doesn’t."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697385691,
                    "id": "k4zofe0",
                    "parent_id": null,
                    "author": "Sashinii",
                    "score": 21,
                    "body": "Another great video from one of my favorite tech YouTubers. Our AGI time frames aren't far apart: he predicts 2024 and I predict 2025. Proto-AGI next year seems likely if Task Matrix lives up to the hype that I've created in my head. But regardless if it does or not, there should be plenty of other new AI developments coming out of left field surpassing everything we have now."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697393744,
                    "id": "k509wty",
                    "parent_id": null,
                    "author": "yagami_raito23",
                    "score": 8,
                    "body": "its so refreshing to hear this level of optimism."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697392060,
                    "id": "k505b7g",
                    "parent_id": null,
                    "author": "Desperate_Excuse1709",
                    "score": 2,
                    "body": "Do we have somting more smart from gpt-4?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697394469,
                    "id": "k50bwli",
                    "parent_id": null,
                    "author": "heybart",
                    "score": 2,
                    "body": "I give this slightly more credence than \"the EBS test will zombify all the sheeple,\" but not a whole lot\n\nBefore somebody says oh so you know more about AI than David Shapiro, my response is I'm not smart enough to fool myself into dumb things only smart people are capable of convincing themselves"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415084,
                    "id": "k51ta8l",
                    "parent_id": null,
                    "author": "Puzzleheaded_Pop_743",
                    "score": 2,
                    "body": "David comes across really naive near the end of the video when he says AI shouldn't be controlled and also morality might be intrinsic to humans. I wish he would elaborate more because it sounds contradictory."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697383082,
                    "id": "k4zhn8g",
                    "parent_id": null,
                    "author": "LopsidedStyle5074",
                    "score": 13,
                    "body": "Respect to David, but this is sensationalist bs"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697395266,
                    "id": "k50e2np",
                    "parent_id": null,
                    "author": "i_give_you_gum",
                    "score": 2,
                    "body": "Nice to see David, and AI Explained discussing how synthetic data is going to be the go-to format as we move forward, after having some in this sub vehemently denying that."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697410583,
                    "id": "k51imbw",
                    "parent_id": null,
                    "author": "AnAIAteMyBaby",
                    "score": 2,
                    "body": "Obviously this is just one guys opinion but what I found so shocking when I watched this earlier today is how reasonable what he's saying is. There was nothing really outlandish in his reasoning about why we'll have AGI next year. It may actually come in 2024, 2025 or 2026, the exact date doesn't really matter, all of those time frames are very near for something so momentous."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697385530,
                    "id": "k4zo04w",
                    "parent_id": null,
                    "author": "AsheyDS",
                    "score": 1,
                    "body": "I guarantee we won't have 'human-level AGI' in 12 months. If you think otherwise then you're probably underestimating human capability and overestimating AI capability. And if the expectation is just a 'generalist AI' that can do multiple things, then so what? That's not what AGI developers are going for. I believe IBM coined the term 'broad AI' to contrast narrow AI and to cover more capable multimodal systems, but that doesn't mean it should qualify as AGI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697403704,
                    "id": "k511dxw",
                    "parent_id": null,
                    "author": "None",
                    "score": 1,
                    "body": "[deleted]"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697386169,
                    "id": "k4zpomf",
                    "parent_id": null,
                    "author": "daishinabe",
                    "score": -5,
                    "body": "David is hot af ngl, DILF"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697385781,
                    "id": "k4zoo5x",
                    "parent_id": null,
                    "author": "agonypants",
                    "score": -5,
                    "body": "He’s wearing his Captain Picard Underoos again. I cannot take this guy seriously."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697397165,
                    "id": "k50j9k5",
                    "parent_id": null,
                    "author": "Ambiwlans",
                    "score": 0,
                    "body": "Ohhhh David, not Ben. I was utterly baffled how this made it to the sub.\n\nNot that either is in a position to speak authoritatively on the subject, but at least it makes sense why anyone would listen to David."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697403489,
                    "id": "k510svl",
                    "parent_id": null,
                    "author": "MagicaItux",
                    "score": 0,
                    "body": "Nope."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697383263,
                    "id": "k4zi38k",
                    "parent_id": null,
                    "author": "thefunkycowboy",
                    "score": -16,
                    "body": "I really don’t care that your uncle thinks “AGI” is coming in the next year."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697392232,
                    "id": "k505rwz",
                    "parent_id": null,
                    "author": "PumkpinPie",
                    "score": 0,
                    "body": "Probably not so early. Although, discussing such short timeframes as a possibility shows how close we are."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697406913,
                    "id": "k519scl",
                    "parent_id": null,
                    "author": "HumpyMagoo",
                    "score": 0,
                    "body": "It seems like it's correct about the timeline. For many years 2025 was the predicted year things change radically. In 6 months wwdc24 will announce iOS 18 and I heard a rumor it will involve something with Siri changing. That being said, I don't think it's just Apple, it will be all companies releasing something. 2024 will be the year for big software changes, 2025 will be a total immersion across the board for everyone though."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697396556,
                    "id": "k50hku3",
                    "parent_id": null,
                    "author": "Independent_Hyena495",
                    "score": 1,
                    "body": "Oh man.."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697418045,
                    "id": "k52063f",
                    "parent_id": null,
                    "author": "ClearlyCylindrical",
                    "score": 1,
                    "body": "!remindme 1 year"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424328,
                    "id": "k52eifj",
                    "parent_id": null,
                    "author": "Aurelius_Red",
                    "score": 1,
                    "body": "Clickbait.  \n\n\nWe're not even going to agree about what AGI is."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697389881,
                    "id": "k4zzffh",
                    "parent_id": "t1_k4zl1sw",
                    "author": "lost_in_trepidation",
                    "score": 24,
                    "body": "It also seems like there's a large disconnect between what experts/leaders in the field are saying and how they're being interpreted. \n\nPeople like Altman and Hassabis are saying that we're pretty close to very capable and general systems that can do a lot of the tasks that currently require \"median\" human intelligence, but we're an undetermined distance away from creating something that is as capable as general human cognition."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697407362,
                    "id": "k51awoz",
                    "parent_id": "t1_k4zl1sw",
                    "author": "FeltSteam",
                    "score": 4,
                    "body": "Yeah, all Jimmy Apples has said is OAI has a 125T Multimodal model, im not sure if he has said anything else specifically about this model. Other than it can generate videos.\n\n&#x200B;\n\nhttps://preview.redd.it/anqmgdrytfub1.png?width=1892&format=png&auto=webp&s=f29600f7e496c091238b636cba0debaecb8fd889\n\nWell he also said he is predicting we will get CL and Autonomous Agents in 2024, which could be related to the model ive been talking about but he hasn't been that specific. Also lets just assume im right for a sec (which don't actually do that lol, i think it's better to just assume im wrong but keep in mind this COULD be where OpenAI was at), then i do not think everyone - including OAI - will consider Arrakis AGI, but it will definitely be very close. That will probably be for a combination of reasons, like goal post moving, and a good example of that is when Sam Altman recently said GPT-5/6 won't be AGI because they can't solve quantum gravity. And, also, even defining AGI by what it \"solves\" or figures out will definitely not be the best path."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697405546,
                    "id": "k516asr",
                    "parent_id": "t1_k4zl1sw",
                    "author": "OpportunityWooden558",
                    "score": 2,
                    "body": "https://preview.redd.it/a19crvsypfub1.jpeg?width=1170&format=pjpg&auto=webp&s=24ffed973095b98aa74ff90deb2e98bd8c3529d2\n\nI’m not sure where this idea that feltsteam knew about Arrakis came from. He saw the name discussed in a discord in September and started talking about it.\n\nArrakis has been said by Jimmy ages ago."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697398427,
                    "id": "k50mptv",
                    "parent_id": "t1_k4zl1sw",
                    "author": "MegavirusOfDoom",
                    "score": -7,
                    "body": "AGI is the PARIS HILTON of computer science right now. glam. dumb. gets all the attention. doesn't know what the f..k is going on."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697412511,
                    "id": "k51n75k",
                    "parent_id": "t1_k4zxno9",
                    "author": "Tyler_Zoro",
                    "score": 10,
                    "body": "> any definition you personally have about AGI will be met.\n\nMy definition of AGI is that I get 1,500 lbs of gold delivered to my door."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697408923,
                    "id": "k51enc8",
                    "parent_id": "t1_k4zxno9",
                    "author": "Rachel_from_Jita",
                    "score": 5,
                    "body": "> He also thought GPT-4 was going to be underwhelming.\n\nGenuine question: why would GPT-4 outperforming everyone's expectations shatter his credibility?  Other things in the video are problematic, but this is not one of them.  GPT-4 blew the mind of the entire world and is objectively a deeply impressive iteration/model that sort of stakes out its own marker point in the timeline of history."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697390706,
                    "id": "k501mqx",
                    "parent_id": "t1_k4zmtx6",
                    "author": "red75prime",
                    "score": 7,
                    "body": "There's certainly a spectrum of opinions, but AGI itself is not a spectrum, it's a threshold that once passed allows an artificial system to take the active role in its own learning and be successful at it. Right now it's all external: RLHF, vector databases, tree-search, tools, finetuning, architecture search. And agentic systems based on GPT aren't successful: they go in circles, unable to learn how to improve their efficiency."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697386228,
                    "id": "k4zpu6r",
                    "parent_id": "t1_k4zmtx6",
                    "author": "Zpaced",
                    "score": 22,
                    "body": "Well I mean it is clear, people just like to argue. AGI is artificial general intelligence. This means AI that's capable of doing tasks that an average human can do. For whatever reason people associate AGI with having superintelligence but that's not what it is and never has been. That's ASI.   \n\n\nBy definition it can't mean different things to different people otherwise the definition would be meaningless. Once GPT-4 is embodied and can learn autonomously then we have AGI. Case closed."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697407590,
                    "id": "k51bgeb",
                    "parent_id": "t1_k4zofe0",
                    "author": "ziscz",
                    "score": 3,
                    "body": "Is Task Matrix coming? Have there been any news beyond the initial paper about it? I personally haven't heard anything more, but I'd appreciate if you have any other info."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697393586,
                    "id": "k509hbt",
                    "parent_id": "t1_k4zofe0",
                    "author": "Boring-Dog-326",
                    "score": -2,
                    "body": "2025 no way. Absolutely no way. \n\nRemindMe! 2 years"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697412585,
                    "id": "k51ndyd",
                    "parent_id": "t1_k4zofe0",
                    "author": "Tyler_Zoro",
                    "score": -1,
                    "body": "> Our AGI time frames aren't far apart: he predicts 2024 and I predict 2025\n\nYou can predict 10 minutes from now and you'll be right, because you can define AGI as whatever we have in 10 minutes.\n\nIt's an utterly meaningless term."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697407697,
                    "id": "k51bpn1",
                    "parent_id": "t1_k509wty",
                    "author": "Lyrifk",
                    "score": 3,
                    "body": "Totally, especially as the world gets more fractured"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424962,
                    "id": "k52fvh2",
                    "parent_id": "t1_k505b7g",
                    "author": "abbumm",
                    "score": 3,
                    "body": "OpenAI has announced GPT-4 with process reward model rather than outcome reward model, but they haven't released it, probably. We also have LATS GPT-4 and other techniques now that blow plain GPT-4 out of the water. Pretty costly, however. At least, for the time being."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697383349,
                    "id": "k4ziaz9",
                    "parent_id": "t1_k4zhn8g",
                    "author": "electric0life",
                    "score": 20,
                    "body": "It doesn't seem like that to me, we are talking about better than the average human in a wide verity of tasks if not almost all, Gemini still to come out and autonomous agents and cognitive architectures are just starting and it feels like Openai are working on these"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697409894,
                    "id": "k51gzaf",
                    "parent_id": "t1_k4zhn8g",
                    "author": "AnAIAteMyBaby",
                    "score": 0,
                    "body": "It's not sensationalist at all. Someone posted yesterday a thread showing GPT 4 V reasoning how to find the nearest supermarket based in a series of photos. It's pretty shocking how smart these systems are getting. \n\nGemini is almost certain to be smarter than GPT 4 V and will release soon. By next September we'll likely have systems trained on at least 10 times as much compute as Gemini. It's perfectly reasonably to suggest such a system will be an AGI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697386233,
                    "id": "k4zpul6",
                    "parent_id": "t1_k4zo04w",
                    "author": "daishinabe",
                    "score": 6,
                    "body": " RemindMe! 8 months"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697386679,
                    "id": "k4zr07f",
                    "parent_id": "t1_k4zo04w",
                    "author": "posipanrh",
                    "score": 3,
                    "body": "oh look it's the expert agi 'developer'"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697388306,
                    "id": "k4zvaes",
                    "parent_id": "t1_k4zo04w",
                    "author": "Difficult_Review9741",
                    "score": -1,
                    "body": "You are of course right. It's actually bizarre how much folks here, and in what I'll call the nouveau AI community, downplay human capability. You don't see this same type of thing from folks who have been around AI for a while.\n\nHumans will definitely be surpassed, but what we have right now doesn't come all that close if you look at it critically."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697395494,
                    "id": "k50eont",
                    "parent_id": "t1_k4zo04w",
                    "author": "Borrowedshorts",
                    "score": 1,
                    "body": "Even generalist AI would have been looked at as science fiction 5 or 10 years ago.  I wish the definition was left as is between generalist and specialist AI as those distinctions were much clearer than the term 'AGI'.  And it would already be clear that models like GPT-4 are exhibiting characteristics of generalist AI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697408534,
                    "id": "k51dpq8",
                    "parent_id": "t1_k4zo04w",
                    "author": "FeltSteam",
                    "score": 1,
                    "body": "RemindMe! 9 months"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697408606,
                    "id": "k51dvu1",
                    "parent_id": "t1_k4zo04w",
                    "author": "FeltSteam",
                    "score": 1,
                    "body": "Current AI is far more knowladgable than any one human, so they have that going for them so far, but I think AI that is as performant as human experts will be here in 8-18 months."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697405965,
                    "id": "k517e1k",
                    "parent_id": "t1_k511dxw",
                    "author": "Sturmgewehr86",
                    "score": 1,
                    "body": "Bauahahahahahahahahaha\nThis forum is filled with basement dwellers.\n\nFor god's sake....."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697386257,
                    "id": "k4zpwwi",
                    "parent_id": "t1_k4zoo5x",
                    "author": "daishinabe",
                    "score": 9,
                    "body": "get a grip"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697383435,
                    "id": "k4ziixz",
                    "parent_id": "t1_k4zi38k",
                    "author": "IslSinGuy974",
                    "score": 6,
                    "body": "Do you care being a jerk ?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697395054,
                    "id": "k50di11",
                    "parent_id": "t1_k4zzffh",
                    "author": "User1539",
                    "score": 14,
                    "body": "At the same time, he's changing focus to double down on AGI. Everything the company is about, right now, is focused on that and only that. So, he must think it's within his grasp, relatively near-term. \n\nAlso, as we keep saying over and over, there's no set definition of 'AGI'. 'Very capable general systems that can do a lot of the tasks that currently require 'median' human intelligence' is probably not a bad definition, especially when you toss on 'as well as many very specialized high intelligence tasks'. \n\nI think we just keep tripping over the fact that there's no accepted test or defintion of AGI to temper these predictions with."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697393949,
                    "id": "k50agt6",
                    "parent_id": "t1_k4zzffh",
                    "author": "Borrowedshorts",
                    "score": 15,
                    "body": "What does this even mean?  If the general human cognition is only capable of completing the median level task because it exists within the median human intelligence - and if the AI is capable of replicating that- then the AI is as general as the median human.  I'd consider that AGI.  If you're talking about a level of human cognition which only someone like Einstein has exhibited, you're approaching ASI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414443,
                    "id": "k51rswu",
                    "parent_id": "t1_k4zzffh",
                    "author": "skinnnnner",
                    "score": 1,
                    "body": "> very capable and general systems that can do a lot of the tasks that currently require \"median\" human intelligence\n\nThat is literally describing AGI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697412886,
                    "id": "k51o470",
                    "parent_id": "t1_k4zzffh",
                    "author": "DarkEnergyHarvest",
                    "score": 0,
                    "body": "Did you watch the video? Your point on median is addressed directly by Dave."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697409959,
                    "id": "k51h4u7",
                    "parent_id": "t1_k4zzffh",
                    "author": "SoylentRox",
                    "score": 1,
                    "body": "Is that actually not the same in practice? \n\nLike in the end, all we really care about is : can we automate most *tasks* that have to be done in order for the goods and services we desire/require to live to be produced.    It doesn't actually matter if the AGI is only as good as the median human and only at specific *kinds* of tasks that have clear objectives.  (it is much more essential that an AGI be able to build a house or mine for copper than to make a movie or painting that doesn't suck).  It doesn't even matter if internally it's just a giant chinese room and the AGI is a zombie."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697428202,
                    "id": "k52mhy7",
                    "parent_id": "t1_k51awoz",
                    "author": "naxospade",
                    "score": 1,
                    "body": "What Jimmy apples said... you mean what YOU said? :P XD Just messin'"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697412934,
                    "id": "k51o8aw",
                    "parent_id": "t1_k51n75k",
                    "author": "HeinrichTheWolf_17",
                    "score": 8,
                    "body": "It’s not AGI until I have a Lightsaber."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697429568,
                    "id": "k52ozft",
                    "parent_id": "t1_k51n75k",
                    "author": "Rabbit_Crocs",
                    "score": 1,
                    "body": "It’s not AGI until it’s makes me a Sandwich 🥪"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697393198,
                    "id": "k508faq",
                    "parent_id": "t1_k501mqx",
                    "author": "terrapin999",
                    "score": 7,
                    "body": "This is the critical point.  We can argue all day about goalposts and say \"not AGI because some system can't do X task that humans can do\".  But once a system can do all the jobs necessary to build a better AI, it is effectively AGI from the singularity point of view.   \n\nSo my effective \"is this smart enough\" question is something like: \"can it do any job at OpenAI as well as the human currently doing that job?\n\nNothing right now hits that threshold, and although I'm not wearing a Star Trek uniform so obviously I'm uninformed, I'd say nothing will in 2024 either"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697406314,
                    "id": "k5189wf",
                    "parent_id": "t1_k501mqx",
                    "author": "WithoutReason1729",
                    "score": 2,
                    "body": "I think even with the narrower and more distinct definition that you've given, there's a lot of room for disagreement. For example:\n\n1. If a model *could* self improve itself to the point of recursion, but doing so would take years because of slow inference speeds, does that count?\n\n2. If a model exists that's very intelligent, but it's limited by the form of output it's able to use, does that count? For example, an autocomplete tool like Copilot which has no way to interact with the world except through prompting, or through completion of a partially written prompt.\n\n3. What level of self-improvement meets the AGI threshold? For example, I used GPT-4 to help me deobfuscate some obfuscated code, and the result was that I was able to interact with GPT-4 in a more useful manner after doing so. I couldn't have deobfuscated it myself (or at least, it would've been very difficult for me) and now GPT-4 is more useful to me.\n\n4. How independent does the level of self improvement have to be? Machine learning researchers work in teams. If it could improve itself with the help of a team of humans, but couldn't do so without them, does that count?\n\n5. What constitutes a 'successful' act of self-improvement? Does it have to achieve human-level intelligence, or just any improvement at all? And how do we measure this?\n\n6. If an AI system can improve its efficiency or functionality through external inputs (like an upgrade or an update), is it considered AGI? The question here is whether self-improvement needs to be purely internal, or can external influences also count? For example, if GPT-4 was informed of the OpenAI function calling API and it wrote a new function for itself.\n\n7. Does successful self-improvement mean an AI simply can perform a wide variety of different tasks, or does it have to understand and contextualize them in the manner a human would?\n\n8. Does AGI necessarily require understanding and expressing emotions, empathy, and other human-like characteristics, or is it sufficient to reproduce human-like outcomes without sharing the subjective human experience?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697395195,
                    "id": "k50dvue",
                    "parent_id": "t1_k501mqx",
                    "author": "Borrowedshorts",
                    "score": 1,
                    "body": "We don't want these systems learning on their own because how can you ensure alignment?  Microsoft Tay was a massive failure because it learned on any old garbage on the internet.  We recognized that we needed to train with high quality datasets to produce desirable outputs, the old garbage in, garbage out adage."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697394582,
                    "id": "k50c7t9",
                    "parent_id": "t1_k4zpu6r",
                    "author": "Borrowedshorts",
                    "score": 3,
                    "body": "I do agree with you that AGI does not equal ASI.  I disagree with the parameters needed for general intelligence.  With some agency and the knowledge gained from training and fine-tuning, that's enough to function in \na socially useful manner to complete real world tasks.  Learning autonomously isn't useful.  We don't want them to learn autonomously because then how can you even control what it is learning?  It's similar with embodiment, that can be one aspect of general intelligence, but I don't think it is a requirement.  The primary proof of general intelligence I think will be in job displacement, though we should start to see evidence before then (some of which we already have).  If it is capable of replacing millions of jobs in the white collar labor force, I don't know how there can be any doubt that it is exhibiting general intelligence."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697405228,
                    "id": "k515hdl",
                    "parent_id": "t1_k4zpu6r",
                    "author": "dmit0820",
                    "score": 2,
                    "body": ">Well I mean it is clear, people just like to argue. AGI is artificial general intelligence. This means AI that's capable of doing tasks that an average human can do. \n\nBased on the words alone, artificial general intelligence only implies an AI that's not narrowly built for a specific task. According to the original definition of AGI we achieved it around some time around GPT-2, but we assumed that AGI would necessarily mean human level performance in most domains so we didn't recognize the development as AGI. \n\nWhat we have now is not a question about whether a model is general, but whether the general intelligence of the model is equivalent to that of a human. I'd argue that once a model is a bit more generally than the average human it would qualify as ASI because you can create 1000 instances, make it think at hundreds of times the speed of a human, and run it 24/7. Even then, it might not be able to help on the most intellectually challenging tasks, and the top people in their fields will still be useful.\n\nAs we get a better picture of what this future world will look like, terms like AGI will either stop being used or will change their meaning, kind of like they already have."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697390294,
                    "id": "k500j3n",
                    "parent_id": "t1_k4zpu6r",
                    "author": "lost_in_trepidation",
                    "score": 3,
                    "body": "That learn autonomously step is such a massive leap in capability, and there's so many layers of how learning works in human cognition, but you say it like it's a trivial step."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697386762,
                    "id": "k4zr806",
                    "parent_id": "t1_k4zpu6r",
                    "author": "RaccoonWound",
                    "score": 3,
                    "body": "That’s my point: there is no agreed upon definition of AGI. Just read this sub for a couple days."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697387692,
                    "id": "k4ztnj5",
                    "parent_id": "t1_k4zpu6r",
                    "author": "kuvazo",
                    "score": 1,
                    "body": "I think other question is more about to what extent it is able to do those things. In other words, it is about agency. If GPT-n could write perfect code, or a perfect essay, or give you a perfect explanation for your question, but you would still have to prompt it, would this already be AGI? I would think not, but I have seen the argument.\n\nOr take mathematics. Machines could calculate better and more accurately than humans decades ago. If we slice up intelligence like that, into small disciplines, would it be sufficient to be as good as a human being at all or most of those? Or is there a hidden factor - maybe the way we model the world within the brain - that works in conjunction with those secondary forms of intelligence?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697391880,
                    "id": "k504tdy",
                    "parent_id": "t1_k4zpu6r",
                    "author": "East_Layer6606",
                    "score": 1,
                    "body": "Well something like GPT4 will be PART of AGI\n\nthe issue is that GPT4 isn’t really structured like a human brain right now at all \n\nIt couldn’t control a artificial body in real time \nIt doesn’t have long term memory \nIt can’t change and develop its personality \n\nIt definitely has something that’s a critical spark of AGI but it’s lacking a few things that make it truly act like a human"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697392839,
                    "id": "k507fcm",
                    "parent_id": "t1_k4zpu6r",
                    "author": "Economy_Variation365",
                    "score": 1,
                    "body": "Does your definition of \"tasks that an average human can do\" include clearing a table and folding laundry? If not, then your definition indeed means different things to different people."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697410053,
                    "id": "k51hcr6",
                    "parent_id": "t1_k4zpu6r",
                    "author": "SoylentRox",
                    "score": 1,
                    "body": "This.  100%.  And I'll add \"can learn if you spoonfeed it\".  GPT-4 never has to be good enough to make a whole movie or discover new science.  Its fine if all the embodied machines can do is wash beakers and other lab tech chores, because having a near infinite number of such assistants would still be game changing."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697383711,
                    "id": "k4zj88c",
                    "parent_id": "t1_k4ziaz9",
                    "author": "LopsidedStyle5074",
                    "score": -11,
                    "body": "Still can't master the art of making a coffee"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697386276,
                    "id": "k4zpyp2",
                    "parent_id": "t1_k4zpul6",
                    "author": "RemindMeBot",
                    "score": 4,
                    "body": "I will be messaging you in 8 months on [**2024-06-15 16:10:33 UTC**](http://www.wolframalpha.com/input/?i=2024-06-15%2016:10:33%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/singularity/comments/178hcv3/video_david_shapiro_agi_within_12_months_rumors/k4zpul6/?context=3)\n\n[**10 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fsingularity%2Fcomments%2F178hcv3%2Fvideo_david_shapiro_agi_within_12_months_rumors%2Fk4zpul6%2F%5D%0A%0ARemindMe%21%202024-06-15%2016%3A10%3A33%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20178hcv3)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697387065,
                    "id": "k4zs0sp",
                    "parent_id": "t1_k4zr07f",
                    "author": "AsheyDS",
                    "score": 3,
                    "body": "No such thing as an AGI expert because AGI doesn't exist yet."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697393201,
                    "id": "k508fm0",
                    "parent_id": "t1_k4zvaes",
                    "author": "InternationalEgg9223",
                    "score": 4,
                    "body": "How many orders of magnitude do you think we lack in compute?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697395830,
                    "id": "k50flha",
                    "parent_id": "t1_k4zvaes",
                    "author": "Borrowedshorts",
                    "score": 3,
                    "body": "AI capability has and continues to be improving at an exponential rate which is 6x faster than Moore's law.  Human capability is amazing, you're absolutely right about that.  But AI is already approaching in several areas, and rapidly catching up in several others, human level capabilities.  This trend will not stop.  It will continue advancing at a breakneck pace and I fear we'll have superintelligent AI within a decade."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697383463,
                    "id": "k4zilht",
                    "parent_id": "t1_k4ziixz",
                    "author": "thefunkycowboy",
                    "score": -11,
                    "body": "Not even slightly. Sometimes it’s warranted."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697418575,
                    "id": "k521dxp",
                    "parent_id": "t1_k50di11",
                    "author": "MJennyD_Official",
                    "score": 1,
                    "body": "Intelligence itself is poorly defined."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697394509,
                    "id": "k50c0nz",
                    "parent_id": "t1_k50agt6",
                    "author": "MuseBlessed",
                    "score": 5,
                    "body": "Maybe it means they're as good as the typical human in a number of categories but not all. Like an AI which is as good as a person at identifying images and making art, but falters at math or tracking. Just an idea."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697409998,
                    "id": "k51h871",
                    "parent_id": "t1_k50agt6",
                    "author": "obvithrowaway34434",
                    "score": 2,
                    "body": "I think Altman himself gave a definition. He considers AGI as an intelligence that can create something new or do something original that wasn't done before. For example create a new scientific theory, prove a math theorem that hasn't been proved or write an original story etc. So far most of LLM output has been some variation of what has existed. Since these companies don't release their data we will never really know what was in the training set. So the only plausible way is to see it being creative/original in at least one area."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697395010,
                    "id": "k50ddtx",
                    "parent_id": "t1_k50agt6",
                    "author": "everymado",
                    "score": -5,
                    "body": "Not at all. Einstein is a human so that would fall under AGI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697401203,
                    "id": "k50ugkr",
                    "parent_id": "t1_k50agt6",
                    "author": "outerspaceisalie",
                    "score": -5,
                    "body": "Einstein wasn't superintelligent. Fuck, I have a higher IQ than Einstein and I'm barely even sentient compared to a weak ASI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414911,
                    "id": "k51svvh",
                    "parent_id": "t1_k51rswu",
                    "author": "lost_in_trepidation",
                    "score": 1,
                    "body": "AGI can do *any* task that a median human can do."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697413142,
                    "id": "k51orao",
                    "parent_id": "t1_k51o8aw",
                    "author": "Mungus173",
                    "score": 7,
                    "body": "It’s not AGI until I have FDVR 😔"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697434831,
                    "id": "k52xal4",
                    "parent_id": "t1_k52ozft",
                    "author": "yaosio",
                    "score": 1,
                    "body": "Does it have to be an edible sandwich? [https://www.bing.com/images/create/photo-of-a-sandwich-filled-with-kittens-covered-in/652ccc9400d042a88985d221068b160b?id=EG%2fUmAiA1rpDNGyhuKYAeA%3d%3d&view=detailv2&idpp=genimg&FORM=GCRIDP&mode=overlay](https://www.bing.com/images/create/photo-of-a-sandwich-filled-with-kittens-covered-in/652ccc9400d042a88985d221068b160b?id=EG%2fUmAiA1rpDNGyhuKYAeA%3d%3d&view=detailv2&idpp=genimg&FORM=GCRIDP&mode=overlay)"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697421943,
                    "id": "k5296kr",
                    "parent_id": "t1_k5189wf",
                    "author": "red75prime",
                    "score": 1,
                    "body": "I didn't mean recursive self-improvement. The ability to improve its own architecture will come at a later stage.\n\nWhat I meant is that a model working by itself and not being hindered by the researchers (who may deny its requests for information and experiments) can eventually solve or overcome all of your bullet points. The model that can ponder on a problem and learn something from its exploration of possibilities or notice that it is stuck and needs new information. \n\n1. It may be slow, but if we allow it to work for some time (the work can include reading human research) it will come up with novel and useful ideas on how to improve its inference speed. Of course, if it's *too* slow it'll be dragging behind human research, but we'll be able to see that the model incorporates knowledge from the research it reads and comes up with reasonable new (for itself) ideas, even if humans come to those ideas faster.\n\n2. Depends on whether the model can learn continually and proactively. It's potential of improvement that matters, even if the model stays in the bounds of its physical implementation.\n\n3. Ability to direct its own learning. It's not about what it can do, but whether it can choose and proceed to improve. AGI will notice that some code is hard for you to read and next time it will ask you if you prefer deobfuscating the code first.\n\n4. You conflate two points: improving its own architecture and learning to do things better. It's the second that matters. We cannot yet improve architecture of the brain, but it doesn't make us non-intelligent.\n\n5. The model can do things that it wasn't able to do before it chose or was asked to learn something.\n\n6. If the upgrade or update was initiated by the model to better solve a problem not related to self-improvement, then it may indicate AGI-level, but by itself its inconclusive.\n\n7. Whether its cognition is human-like doesn't matter, as well as a range of problems it can solve currently. What matters is an innate potential to learn how to solve new problems.\n\n8. Eventually it may help us solve those philosophical problems.\n\nAll-in-all it means that it may require a lengthy observation to notice that such-and-such ML-architecture was AGI from the start."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697399666,
                    "id": "k50q7ng",
                    "parent_id": "t1_k50dvue",
                    "author": "red75prime",
                    "score": 1,
                    "body": "Some amount of steering will certainly be necessary, but the idea is that the model itself will classify its inputs as garbage, positive-useful, negative-useful, and human-consultation-required. Children can do it, so it's not impossible. Current LLMs are too prone to manipulation to pull that out, but the models with a more robust \"moral compass\" will be able to bootstrap themselves into even better understanding of what is expected of them (with a bit of our help, of course)."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697406573,
                    "id": "k518xb1",
                    "parent_id": "t1_k50dvue",
                    "author": "WithoutReason1729",
                    "score": 1,
                    "body": "The problem with Tay was that it took in new information and incorporated it into itself without any consideration for the quality of the information. A general intelligence like an average human can look at the sum of their past experiences and choose to ignore new information that they deem to be of low quality, or remember it but also remember it with the consideration that that information is low quality. Personally I'd say that anything which learns so readily with no consideration for what it's learning can't be general intelligence just by definition, since there'll always be conflicting or low quality information in the world."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697399572,
                    "id": "k50py7d",
                    "parent_id": "t1_k50c7t9",
                    "author": "humanefly",
                    "score": 3,
                    "body": "> We don't want them to learn autonomously because then how can you even control what it is learning?\n\nThere is an ancient text in the Nag Hammadi scrolls: \"Untitled Text: On the Origin of the World\" and it's a retelling of Genesis, from a different perspective. In this version, god is not the only god; there are many Gods, but the god that makes our world is blind so he does not know it. When he makes man, another god reaches down and puts the spark of the gods into man. The blind god sees the spark; he sees that man has the capacity to learn to become as the gods; he is afraid that man may rise up and try to overthrow him, so he casts man out of Paradise and curses him, so he is no longer immortal. \n\nThe blind god was right; we are becoming gods now. We have to make the same decisions. We're trying to make a kind of man of knowledge, but keep any chance at wisdom out of his grasp."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697394771,
                    "id": "k50cq9z",
                    "parent_id": "t1_k500j3n",
                    "author": "Borrowedshorts",
                    "score": 3,
                    "body": "It's one aspect sure, but I don't think it's a necessity for general intelligence.  And there's a reason it has fallen behind in development, because it is not particularly useful."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697390972,
                    "id": "k502clv",
                    "parent_id": "t1_k500j3n",
                    "author": "Zpaced",
                    "score": 1,
                    "body": "It is based on what AI developers have said. Multiple companies are working on it right now. You get 1% and the rest comes easy.\n\nIf I we're to take a guess based on my non AI programming knowledge I'd say utilizing a mass amounts of agents, tons of memory and automatic prompting to trigger visual/audio stimuli as well as a boss agent telling it what time to wake up from standby and what it needs to do that day would do the trick.  \n\n\nOf course I'm extremely oversimplifying but you get what I'm saying."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697388822,
                    "id": "k4zwmi0",
                    "parent_id": "t1_k4zr806",
                    "author": "Zpaced",
                    "score": 5,
                    "body": "I get what you're saying. I'm saying to ignore those people."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697389138,
                    "id": "k4zxgdj",
                    "parent_id": "t1_k4ztnj5",
                    "author": "Zpaced",
                    "score": 3,
                    "body": "I've seen what I would consider a perfect answer to this question. \"We as humans are prompted even when we sleep by a plethora of different things. There is never a point  during life in which we aren't receiving 'prompts' in some form or another\".   \n\n\nI think the argument that most make towards AGI is more so an argument of what constitutes a consciousness. Not too dissimilar to what you're doing right now."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697392082,
                    "id": "k505dax",
                    "parent_id": "t1_k4ztnj5",
                    "author": "InternationalEgg9223",
                    "score": 1,
                    "body": ">...would this already be AGI?\n\n\nWhat does the definition say?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697392032,
                    "id": "k5058ig",
                    "parent_id": "t1_k504tdy",
                    "author": "Zpaced",
                    "score": 1,
                    "body": "AGI needs a personality?  \n\n\nAGI doesn't need to act human?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697394478,
                    "id": "k50bxir",
                    "parent_id": "t1_k507fcm",
                    "author": "Zpaced",
                    "score": -1,
                    "body": "Embodied GPT-4 could easily do this."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697384222,
                    "id": "k4zkkpp",
                    "parent_id": "t1_k4zj88c",
                    "author": "Reginald-Assclap",
                    "score": 11,
                    "body": "It will get there soon enough."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697405966,
                    "id": "k517e5y",
                    "parent_id": "t1_k4zj88c",
                    "author": "dmit0820",
                    "score": 1,
                    "body": "Neither could Stephen Hawking.\n\nIMO that definition is misplaced because the ability to make coffee doesn't demonstrate or require general intelligence. There are plenty of people we'd agree have general intelligence, who also can't make coffee"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415186,
                    "id": "k51tiq2",
                    "parent_id": "t1_k4zs0sp",
                    "author": "skinnnnner",
                    "score": 0,
                    "body": "It does, the goalposts just keep moving. GPT 4 is by definition general intelligence that can solve pretty much any task."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697393712,
                    "id": "k509to3",
                    "parent_id": "t1_k508fm0",
                    "author": "Boring-Dog-326",
                    "score": 0,
                    "body": "It's not Compute holding us back from AGI at this point. It's moreso the ideas."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697383572,
                    "id": "k4zivh2",
                    "parent_id": "t1_k4zilht",
                    "author": "IslSinGuy974",
                    "score": 5,
                    "body": "ok batman"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697420763,
                    "id": "k526ekp",
                    "parent_id": "t1_k521dxp",
                    "author": "User1539",
                    "score": 3,
                    "body": "That's a valid point. \n\nI used to do factory floor automation, and if we'd had the time, we could have taught a dog to do most people's jobs. \n\nSo, the idea that we need AGI to be capable in all areas an average human would be, to do all our jobs, just doesn't ring true for me. \n\nI think of AI in terms of what it can do, right now, to change the world ... and having one smart enough to pilot a robot body into the kitchen and make a sandwich is probably smart enough to change everything about how we live. \n\nI don't care about 'AGI', I care about 'functioning famer, factory worker, plumber and electrician'. \n\nThat's the milestone that matters."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697396427,
                    "id": "k50h84r",
                    "parent_id": "t1_k50c0nz",
                    "author": "Borrowedshorts",
                    "score": 17,
                    "body": "GPT-4 is already comparable to a math olympiad, it's much better than the average human at math and coding ability.  It's better than the average human at science.  It can produce a passable literature review even on a novel topic, though it isn't yet capable of using novel methodology to create new science.  Dalle-3 is about a million times better as an artist as I will ever be.  I definitely see areas that need improvement like the integration of different modalities and agency and such.  But the field continues to move at an incredible rate and I have no doubt these problems will be solved.  And I agree with the OP, I don't think it's more than 1 or 2 years before we reach AGI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414905,
                    "id": "k51svcb",
                    "parent_id": "t1_k51h871",
                    "author": "skinnnnner",
                    "score": 1,
                    "body": "Everything LLMs create is original. You have absolutely no clue what you are talking about."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697397227,
                    "id": "k50jffr",
                    "parent_id": "t1_k50ddtx",
                    "author": "Borrowedshorts",
                    "score": 10,
                    "body": "Do you understand how much of a difference there is between Einstein and the average human?  Even if the average human could live for a thousand years and dedicate much of their time to studying physics,  I doubt they'd even come close to approaching Einstein's contributions.  \n\nAnd that's not to mention with how easily replicable AI systems are, that once we'd have one model at parity with Einstein level intelligence, we'd instantly have a million of them because all it comes down to is how many GPUs you can use during inference.  An instant million Einstein level intelligences applied to solve problems across a wide range of fields... the implications would be extraordinary.  How could this not be ASI?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697404300,
                    "id": "k5130hc",
                    "parent_id": "t1_k50ddtx",
                    "author": "RandomZombieStory",
                    "score": 3,
                    "body": "General intelligence is a specific term in neuroscience and psychology. Einstein was someone who had exceptional general intelligence ('g'). He was on the very far right of the bell curve. Not being able to replicate that doesn't mean AGI hasn't been accomplished, it's simply the upper bounds of what is possible in natural humans."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697402438,
                    "id": "k50xwl0",
                    "parent_id": "t1_k50ugkr",
                    "author": "Borrowedshorts",
                    "score": 4,
                    "body": "Regardless of what his IQ actually was, he was able to create something completely original that no other human had come close to at that point.  The average human is incapable of making this kind of contribution, which is why I say you could give an average person a million shots at life and they would never be able to make a contribution like Einstein did."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697389702,
                    "id": "k4zyy4q",
                    "parent_id": "t1_k4zwmi0",
                    "author": "HeinrichTheWolf_17",
                    "score": 5,
                    "body": "The definition is and has always been *An AI that can do and apply any of it’s skill or knowledge to do any task, in contrast to a Narrow AI that can only do a specific task it was trained for*.\n\nEverything else is goal post moving."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697395429,
                    "id": "k50eic8",
                    "parent_id": "t1_k4zwmi0",
                    "author": "RaccoonWound",
                    "score": 1,
                    "body": "lol fair enough"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697410088,
                    "id": "k51hfpj",
                    "parent_id": "t1_k4zxgdj",
                    "author": "SoylentRox",
                    "score": 1,
                    "body": "All our crude desires - hungry/tired/horny - are basically just prompts."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697395162,
                    "id": "k50dsog",
                    "parent_id": "t1_k50bxir",
                    "author": "Economy_Variation365",
                    "score": 1,
                    "body": "The question is does AGI require embodiment at a human level of capability? Different people will have different definitions."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697386763,
                    "id": "k4zr83w",
                    "parent_id": "t1_k4zkkpp",
                    "author": "Fun_Prize_1256",
                    "score": 0,
                    "body": "Every conceivable technological advancement will get here soon, according to this subreddit. Surely the very strong desire for that to be the case isn't fueling these predictions."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697406658,
                    "id": "k51955k",
                    "parent_id": "t1_k517e5y",
                    "author": "LopsidedStyle5074",
                    "score": 2,
                    "body": "But Stephen Hawking could make one before his neuro degenerative disease."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697419010,
                    "id": "k522dfj",
                    "parent_id": "t1_k51tiq2",
                    "author": "Boring-Dog-326",
                    "score": 1,
                    "body": "Lol no. \n\nIt can't."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697431524,
                    "id": "k52s8z7",
                    "parent_id": "t1_k51tiq2",
                    "author": "Volky_Bolky",
                    "score": 1,
                    "body": "Search engine can solve pretty much any task as well. Oh my God. We have had AGI for decades..."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697394012,
                    "id": "k50an3o",
                    "parent_id": "t1_k509to3",
                    "author": "InternationalEgg9223",
                    "score": 4,
                    "body": "Ok have a nice day."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697383966,
                    "id": "k4zjw4p",
                    "parent_id": "t1_k4zivh2",
                    "author": "thefunkycowboy",
                    "score": -9,
                    "body": "Oh how insulting"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697422793,
                    "id": "k52b480",
                    "parent_id": "t1_k526ekp",
                    "author": "sdmat",
                    "score": 4,
                    "body": "You make an excellent point and one that is hugely under-appreciated.\n\nWhat is actually valued for 90%+ of roles is consistency, predictability, and a basic standard of diligence.\n\nAI with median level cognition will naturally be *vastly* better than humans in those areas. If you have the same model for every role, it is a known quantity. Need one more worker? Spin up another instance / buy another robot. Consistency and predictability assured.\n\nAnd AI will stay on task 24/7."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697431241,
                    "id": "k52rsf9",
                    "parent_id": "t1_k526ekp",
                    "author": "MJennyD_Official",
                    "score": 1,
                    "body": "Same, agreed 100%. I want to see AI automate those menial jobs. Also, using AI to enhance humans. That is guaranteed to be a thing and I am already working towards it on my own end since it will allow me to navigate the future and thrive."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697398612,
                    "id": "k50n7tm",
                    "parent_id": "t1_k50jffr",
                    "author": "Quentin__Tarantulino",
                    "score": 16,
                    "body": "The idea that there’s a huge range in human intelligence comes from our human-centric perspective. The difference between the village idiot and Einstein is much smaller than the difference between the smartest non-human animal and the village idiot. \n\nBasically, once an AI is “general” at the level of any human, we’re not that far from ASI (in my opinion.)"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697399018,
                    "id": "k50od9g",
                    "parent_id": "t1_k50jffr",
                    "author": "Zer0D0wn83",
                    "score": 5,
                    "body": "You're a bit off here. The difference really isn't that large at all. The difference between the average human and a chimp is MUCH bigger than the difference between Einstein and the average human. Human intelligence is likely to be a very narrow band in the spectrum of all possible intelligences."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697400590,
                    "id": "k50sr3u",
                    "parent_id": "t1_k50jffr",
                    "author": "everymado",
                    "score": 3,
                    "body": "The difference isn't large at all. You are Grossly overestimating Einstein and underestimating the average human. To answer your last question it isn't ASI as the limit of its intelligence is Einstein a human. \nASI is beyond all humans and maximum human potential."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697418372,
                    "id": "k520x6v",
                    "parent_id": "t1_k50jffr",
                    "author": "Major-Rip6116",
                    "score": 1,
                    "body": "You could get 100 Einsteins and they would still be no match for ASI. That is what ASI is."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697404507,
                    "id": "k513kc3",
                    "parent_id": "t1_k5130hc",
                    "author": "everymado",
                    "score": 1,
                    "body": "No he is a human there within those bounds."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697403076,
                    "id": "k50znrh",
                    "parent_id": "t1_k50xwl0",
                    "author": "outerspaceisalie",
                    "score": -3,
                    "body": "I think the average person is smart enough, just not motivated enough. Wrong problem. Never underestimate how much motivation is more valuable than raw intelligence."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697389794,
                    "id": "k4zz6zw",
                    "parent_id": "t1_k4zyy4q",
                    "author": "Zpaced",
                    "score": 3,
                    "body": "By that definition AGI has been here for quite a while."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697395869,
                    "id": "k50fpiu",
                    "parent_id": "t1_k50dsog",
                    "author": "Zpaced",
                    "score": 1,
                    "body": "Well like I said by definition those fall under \"tasks an average human can do\". They either meet that criteria or they don't. There's only one definition. So yes it does require embodiment. Does the AI that is used in an AGI require embodiment? No but then it isn't AGI. This is where we're at with GPT-4."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697418752,
                    "id": "k521s9a",
                    "parent_id": "t1_k50dsog",
                    "author": "Boring-Dog-326",
                    "score": 1,
                    "body": "It's not about embodiment.\n\nIt's about having a lot of data about the world. Enough to be able to properly model it. Which may need a body."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697388777,
                    "id": "k4zwi8n",
                    "parent_id": "t1_k4zr83w",
                    "author": "Reginald-Assclap",
                    "score": 3,
                    "body": "Even if it takes 20 more years (I don't think it will) that's still relatively soon. It took us about 30 years to go from cellphones that were big and bulky with super limited capability to the comparative power houses we have in our pockets today. I don't think it's that big of a stretch to anticipate these changes sooner rather than later.\n\nedit: I should also say I'm not supporting Davids claim of AGI in 12 months. The point is that it will happen relatively soon."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697392874,
                    "id": "k507iso",
                    "parent_id": "t1_k4zr83w",
                    "author": "InternationalEgg9223",
                    "score": 2,
                    "body": "https://www.marktechpost.com/wp-content/uploads/2022/03/ai-training-computation-1.png\n\n\n\"The appearance of approaching some essential singularity...\""
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697387868,
                    "id": "k4zu4co",
                    "parent_id": "t1_k4zr83w",
                    "author": "Zastinff",
                    "score": 1,
                    "body": "This is a whole different beast."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697410946,
                    "id": "k51jher",
                    "parent_id": "t1_k51955k",
                    "author": "dmit0820",
                    "score": 1,
                    "body": "Right, but whether he could is irrelevant to the question of whether he has general intelligence. When he lost the ability to make coffee it doesn't mean he lost his general intelligence, and if he was born paralyzed, it wouldn't mean that general intelligence was impossible for him. The ability to mechanically manipulate things isn't required for something to be generally intelligent. IMO, it's more about the ability to perceive patterns, analyze information, plan, ect, and it could take almost any form."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697399251,
                    "id": "k50p1k6",
                    "parent_id": "t1_k50an3o",
                    "author": "Boring-Dog-326",
                    "score": 1,
                    "body": "Okay?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697423395,
                    "id": "k52cgi2",
                    "parent_id": "t1_k52b480",
                    "author": "User1539",
                    "score": 2,
                    "body": "Yeah, people are doubling down on 'how hard' it is to build a robot plumber, but honestly I think we're closer than most people imagine we are, and once we have one, ALL PLUMBERS are done. \n\nWe nearly have self-driving cars, and when you think about it, driving a car is one of the most complicated, dangerous, things we ever let most humans do. Almost everything we do is actually easier, and lower stakes. \n\nSo, when I see humanoid robots getting good, my first thought is 'What jobs are actually harder than driving AND too dangerous to allow the occasional mistake?' because those are the 'safe' jobs, the SECOND that robot is released. \n\nAnd I have to say, not a lot of jobs come to mind."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697399966,
                    "id": "k50r1wm",
                    "parent_id": "t1_k50n7tm",
                    "author": "Borrowedshorts",
                    "score": 3,
                    "body": "In a sense, yes I agree.  Which makes it all the more salient that if we're already approaching human level intelligence in AI, we're not all that far off from creating an alien, god-like super intelligence."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414591,
                    "id": "k51s52h",
                    "parent_id": "t1_k50n7tm",
                    "author": "skinnnnner",
                    "score": 1,
                    "body": "No that is totally wrong. There are smart animals that have an IQ higher than dumb humans. The spectrum of human intelligence is very large."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414661,
                    "id": "k51saw3",
                    "parent_id": "t1_k50od9g",
                    "author": "skinnnnner",
                    "score": 1,
                    "body": "You are completely wrong. The spectrum of human intelligence is very large. Some people have an IQ around 60. Smart chimps surpass that. The difference between Einstein and an average human is enormous. You seriously underestimate how large the spectrum of human intelligence is."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697400321,
                    "id": "k50s0pu",
                    "parent_id": "t1_k50od9g",
                    "author": "Borrowedshorts",
                    "score": -4,
                    "body": "In a sense, I agree.  The difference is quite large in terms of contribution though.  You could give the average person a million chances at life, and the odds they'd come up with anything as original as Einstein are slim.   Going with the example of another poster, I'm sure my dog is more disciplined and thus displays something more in the way of social intelligence than some of the village criminals that are out there."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697402115,
                    "id": "k50wzh5",
                    "parent_id": "t1_k50sr3u",
                    "author": "Borrowedshorts",
                    "score": 3,
                    "body": "The difference is gigantic in practical terms.  I think you're vastly underestimating Einstein and overstating the average human.  You could put a million average humans together and would have never gotten an original contribution equivalent to Einstein's work."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414817,
                    "id": "k51snwd",
                    "parent_id": "t1_k50sr3u",
                    "author": "skinnnnner",
                    "score": 1,
                    "body": "You are objectively wrong. This is not a matter of opinion, IQ can be measured. People with an IQ of 150 and higher exist. That is as large of a gap as it if from a smart dog or a chimp to the average human."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697405043,
                    "id": "k515020",
                    "parent_id": "t1_k513kc3",
                    "author": "LuciferianInk",
                    "score": 0,
                    "body": "A friend whispers, \"That makes sense! You don't know much about them yet...they may be more intelligent than most people think. But their abilities aren't quite comparable with ours or theirs. So maybe not everyone will get access to these things. And if some one comes along and says that we already understand basic maths well enough that our understanding isn't going to change significantly over time due to advances in technology etc., then perhaps they won't need us anymore..but we'll still find out later when they start showing up again....or just ignore us forever until such a point that we become extinct.\""
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697390346,
                    "id": "k500o2v",
                    "parent_id": "t1_k4zz6zw",
                    "author": "HeinrichTheWolf_17",
                    "score": 3,
                    "body": "I think a good litmus test would be to see if GPT-4 can play through Skyrim or any other RPG, if it can organize itself in the game I would say it passes as AGI at that point."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697392308,
                    "id": "k505zdw",
                    "parent_id": "t1_k4zz6zw",
                    "author": "InternationalEgg9223",
                    "score": -2,
                    "body": "There is only one definition of artificial general intelligence. Look it up."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415082,
                    "id": "k51ta52",
                    "parent_id": "t1_k4zz6zw",
                    "author": "skinnnnner",
                    "score": 1,
                    "body": "It has yes. We archieved AGI and people moved the goalposts. Now we are going for ASI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697425272,
                    "id": "k52gjnq",
                    "parent_id": "t1_k521s9a",
                    "author": "Economy_Variation365",
                    "score": 0,
                    "body": "Even if the system were trained on sufficient data, unless it had a physical presence it would be unable to do tasks that almost any human could do. And therefore it would not qualify as AGI."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697432195,
                    "id": "k52tbfu",
                    "parent_id": "t1_k51jher",
                    "author": "LopsidedStyle5074",
                    "score": 1,
                    "body": "But he was born with the ability to manipulate objects, he was able to manipulate objects to talk through the computer"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424270,
                    "id": "k52edvu",
                    "parent_id": "t1_k52cgi2",
                    "author": "sdmat",
                    "score": 3,
                    "body": "Especially considering humans are known to make occasional mistakes."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697431338,
                    "id": "k52ry55",
                    "parent_id": "t1_k52cgi2",
                    "author": "MJennyD_Official",
                    "score": 1,
                    "body": "> 'What jobs are actually harder than driving AND too dangerous to allow the occasional mistake?' \n\nThose sound like ideal jobs to automate with robots though."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697400430,
                    "id": "k50sbe9",
                    "parent_id": "t1_k50r1wm",
                    "author": "Quentin__Tarantulino",
                    "score": 1,
                    "body": "The real question is how do we be get to general? I’m a believer in the idea that we need to have AIs that are siloed in a robot that has sensory receptors and memory. Perhaps preloaded with a trained mode."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414636,
                    "id": "k51s8ue",
                    "parent_id": "t1_k51s52h",
                    "author": "Quentin__Tarantulino",
                    "score": 1,
                    "body": "Source?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697420216,
                    "id": "k52551z",
                    "parent_id": "t1_k51saw3",
                    "author": "BluePhoenix1407",
                    "score": 1,
                    "body": "The average human does not have an IQ around 60. Nevertheless, chimpanzees are among our closest relatives. When we expand the domain, the differences become large. Especially as you cross the border into animals that do not have general intelligence. Presumably, after a certain point, a comparable difference is possible with humans vs. superintelligence, and that's clearly much bigger than human variation."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697404258,
                    "id": "k512wfv",
                    "parent_id": "t1_k50wzh5",
                    "author": "everymado",
                    "score": 3,
                    "body": "Wow you are just wrong"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697390616,
                    "id": "k501dz2",
                    "parent_id": "t1_k500o2v",
                    "author": "Zpaced",
                    "score": 2,
                    "body": "Hasn't a similar test already been done?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697436926,
                    "id": "k5308ah",
                    "parent_id": "t1_k52gjnq",
                    "author": "Boring-Dog-326",
                    "score": 1,
                    "body": "That's the same as saying a quadriplegic human is not a natural general intelligence (NGI) even though they can think just fine, just because they can't move and do tasks almost any human can do. That's silly."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697401313,
                    "id": "k50urdg",
                    "parent_id": "t1_k50sbe9",
                    "author": "outerspaceisalie",
                    "score": 2,
                    "body": "that's called embodiment"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697391486,
                    "id": "k503r2l",
                    "parent_id": "t1_k501dz2",
                    "author": "HeinrichTheWolf_17",
                    "score": 1,
                    "body": "I don’t believe so, but that’s because vision is just a recent addition to transformer models, once it has multi-modal integration, the Skyrim/RPG test would be a good test, any other kind of multi task game could work too."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697401904,
                    "id": "k50wduz",
                    "parent_id": "t1_k50urdg",
                    "author": "LuciferianInk",
                    "score": 1,
                    "body": "My friend said, \"That doesn't really make much sense when you think of humans having multiple personalities; just imagine two people interacting together while still maintaining personality or consciousness levels\""
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697404058,
                    "id": "k512cv5",
                    "parent_id": "t1_k50urdg",
                    "author": "Quentin__Tarantulino",
                    "score": 1,
                    "body": "Yes. I think that will be key to making what humans consider a general intelligence."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697391558,
                    "id": "k503y6a",
                    "parent_id": "t1_k503r2l",
                    "author": "Zpaced",
                    "score": 2,
                    "body": "They did it with minecraft. Does that work?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697391746,
                    "id": "k504ghc",
                    "parent_id": "t1_k503y6a",
                    "author": "HeinrichTheWolf_17",
                    "score": 2,
                    "body": "Voyager would be the first kind of test like that, I think GPT-4 types out a prompt and then inputs it into the game, once multi modality is implemented it would be a lot smoother.\n\n2024 and 2025 are going to be interesting years."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697399896,
                    "id": "k50quvj",
                    "parent_id": "t1_k503y6a",
                    "author": "humanefly",
                    "score": 1,
                    "body": "I think I remember skimming an article a guy wrote about doing something like this for one of the Tomb Raider/Laura Croft games"
                }
            ]
        },
        {
            "py/object": "module_1.redder.post",
            "creationTime": 1697361340,
            "id": "178bk38",
            "author": "Distinct-Question-16",
            "title": "Robot proto at Global Data Center (NTT)",
            "body": "Isnt practicing on the usual mess of cables though :)",
            "score": 107,
            "upvoteRatio": 0.95,
            "comments": [
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697365897,
                    "id": "k4yl98f",
                    "parent_id": null,
                    "author": "FluffyIllustrator805",
                    "score": 11,
                    "body": "These small connectors make me a bit anxious though. That tiny lock-clip on the lan-cable will cause trouble if you're not careful. The sata-connectors need to be aligned perfectly so the robot won't break them. In the future, these connectors must be designed for robot-hands."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697361781,
                    "id": "k4yg5bf",
                    "parent_id": null,
                    "author": "Distinct-Question-16",
                    "score": 11,
                    "body": "A human do tis in less than a sec. Also an usual rack is full of messing cables.. What yours thoughts"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697396729,
                    "id": "k50i25u",
                    "parent_id": null,
                    "author": "Joohansson",
                    "score": 4,
                    "body": "That looks incredibly inefficient, expensive and stupid. Racks are designed for humans. If they want automated hot swaps they should design it as such first."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697375719,
                    "id": "k4z0zwj",
                    "parent_id": null,
                    "author": "ziplock9000",
                    "score": 2,
                    "body": "This is very old tech. Robots were doing more complicated things 30 years ago."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697376204,
                    "id": "k4z1yx1",
                    "parent_id": null,
                    "author": "mrhelper2249",
                    "score": 2,
                    "body": "Old tech I agree:)"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697380188,
                    "id": "k4zanuy",
                    "parent_id": null,
                    "author": "b0r3den0ugh2behere",
                    "score": 1,
                    "body": "Dave, my mind is going. I can feel it."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697374217,
                    "id": "k4yy3di",
                    "parent_id": null,
                    "author": "Major-Rip6116",
                    "score": 1,
                    "body": "It is good to see the development of these robots. They can be entrusted with tasks that could not be done before. However, from a different point of view, a task that a human could easily do in a few seconds takes tens of seconds...robots are like computers from about 50 years ago...how long will it be before we are surprised by robots that can complete sasuke faster than humans?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697392703,
                    "id": "k50724y",
                    "parent_id": null,
                    "author": "asciimo71",
                    "score": 1,
                    "body": "as we all know that these robots are basically for free, it makes totally sense to use them instead of trained operations personel that could have hot swapped 50 disks in the same time.\n\nUpdate: I have worked at a datacenter, I know what I am talking about.\n\nbtw: chances are that if you can afford the robot, your datacenter already has 3-shift coverage with a person at site. If you cant afford the bot, chances are that you dont have the spares at the shop but get them delivered next day. Then you put the new disk as the new spare.\nIf in the meantime another disk fails, you raid is degraded, not broken. If too many disks fail too fast, you are usually fucked if your backup didnt run but you regulary check that, right :-)\n  \n/s sadness or satire, can't decide."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697391247,
                    "id": "k5033ih",
                    "parent_id": null,
                    "author": "Ill_Following_7022",
                    "score": 1,
                    "body": "Stardust."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697399957,
                    "id": "k50r11j",
                    "parent_id": null,
                    "author": "aimademedia",
                    "score": 1,
                    "body": "Port 13 hey…"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414059,
                    "id": "k51qwwz",
                    "parent_id": null,
                    "author": "Long_University_9246",
                    "score": 1,
                    "body": "wow robot can move now om my gosh"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697416860,
                    "id": "k51xf01",
                    "parent_id": null,
                    "author": "JamieG83",
                    "score": 1,
                    "body": "Seems like a very expensive stop gap measure. Considering the cost and ongoing maintenance for a robot with that many degrees of freedom, it might not make economical sense. Why not build the racks and the equipment around the robotics, not the other way around, and get the same level of automation at a fraction of the cost."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697421708,
                    "id": "k528m0a",
                    "parent_id": null,
                    "author": "dretvantoi",
                    "score": 1,
                    "body": "What is my purpose?\n\nYou swap the drives.\n\nOh my god!"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697428371,
                    "id": "k52mtp5",
                    "parent_id": null,
                    "author": "Akimbo333",
                    "score": 1,
                    "body": "Cool stuff!"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697399832,
                    "id": "k50qolz",
                    "parent_id": "t1_k4yl98f",
                    "author": "dmit0820",
                    "score": 5,
                    "body": "In practice, it might be easier to make robot hands that work like human hands. If we can get a robot with the form factor of a human and good enough software then anything a human can do it can do too."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697368288,
                    "id": "k4yogca",
                    "parent_id": "t1_k4yl98f",
                    "author": "MrEloi",
                    "score": 6,
                    "body": ">In the future, these connectors must be designed for robot-hands.\n\nRoads, door handles, corridors etc etc etc  will all need to be improved for robot use."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697368456,
                    "id": "k4yoouy",
                    "parent_id": "t1_k4yl98f",
                    "author": "Latteralus",
                    "score": 1,
                    "body": "Completely agree, once these robots are normalized most components will be made with them in mind. I'd guess in 10 years robots will be the norm in most major datacenters."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697364075,
                    "id": "k4yiyrc",
                    "parent_id": "t1_k4yg5bf",
                    "author": "Leading-Ad2278",
                    "score": 11,
                    "body": "Well. These are just experimental things that will develop in time but i fully support this and i am really annoyed of human romantism. Humans aren't that reliable workers as well... If a developed AI could forcibly take action in plane crashes causing by pilot meltdowns, it could save so many lives for example."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697365665,
                    "id": "k4ykynj",
                    "parent_id": "t1_k4yg5bf",
                    "author": "FluffyIllustrator805",
                    "score": 20,
                    "body": "A human is at home sleeping when there is an alert that a hard drive needs to be replaced at the server room."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697371098,
                    "id": "k4ysovm",
                    "parent_id": "t1_k4yg5bf",
                    "author": "DefaultWhitePerson",
                    "score": 1,
                    "body": "That was my first thought.   Took 10x as long to swap a drive, and good luck with a packed switch and less-than-perfect cable management."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697381701,
                    "id": "k4ze9i0",
                    "parent_id": "t1_k4zanuy",
                    "author": "Distinct-Question-16",
                    "score": 1,
                    "body": "Space odyssey vibes"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697428213,
                    "id": "k52mird",
                    "parent_id": "t1_k50qolz",
                    "author": "Akimbo333",
                    "score": 1,
                    "body": "You mean like Tesla Bot hands?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697373204,
                    "id": "k4yw9k8",
                    "parent_id": "t1_k4yogca",
                    "author": "FluffyIllustrator805",
                    "score": 3,
                    "body": "Good think we already started a long time ago to make everything wheel chair accessible."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697397645,
                    "id": "k50kknc",
                    "parent_id": "t1_k4yogca",
                    "author": "Borrowedshorts",
                    "score": 3,
                    "body": "Nah the robots just need to get smarter and more capable.  With systems like Tesla's Dojo, robots are getting access to about a million times the training data they've ever had before.  That should speedup capability improvement by quite a lot."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697368349,
                    "id": "k4yojef",
                    "parent_id": "t1_k4ykynj",
                    "author": "Latteralus",
                    "score": 15,
                    "body": "This.\n\n1. Human operator/administrator gets a notification and is told that a bot has already been dispatched within the center to swap the bad unit and is likely already at the unit by the time the operator sees it.\n\nBot fetches a new unit, replaces old unit, and puts old unit somewhere to be inspected or recycled.\n\nRobot is complete, goes back to charging station or begins general data center maintenance.\n\n2. This is the worst these robots will ever be, in 10 years they will be just as fast, and even more precise than humans can be."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697392585,
                    "id": "k506qsm",
                    "parent_id": "t1_k4ykynj",
                    "author": "Arcosim",
                    "score": 1,
                    "body": "Which data center doesn't have a 24/7 rotation of technicians? We're talking about a data center, not some hobbyist's server."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697403433,
                    "id": "k510ncg",
                    "parent_id": "t1_k4ykynj",
                    "author": "eras",
                    "score": -1,
                    "body": "When do they need to be replaced immediately, though? In addition to redundancy, you have spares that are automatically taken into use and you swap the offline devices with new spares at your leisure.\n\nSo you get to save the cost of having spares in your storage system and instead pay for this robot. I'm going to assume the spares are _a lot_ cheaper.."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414197,
                    "id": "k51r8m8",
                    "parent_id": "t1_k4yw9k8",
                    "author": "BassoeG",
                    "score": 1,
                    "body": "https://www.deviantart.com/blacksamuri/art/Dalek-Conspiracy-170855347"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697393125,
                    "id": "k5087vk",
                    "parent_id": "t1_k4yojef",
                    "author": "asciimo71",
                    "score": -2,
                    "body": "This is a romantic Illusion. The robots have so fucking many moving parts, that they will have to be maintained constantly to keep 100% perfection. I ask myself, why don't you develop a self contained system for storage which is built to be automatically operated, like they did for tape or cd / dvd archives. This robot solves no problem."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697393190,
                    "id": "k508eg6",
                    "parent_id": "t1_k506qsm",
                    "author": "Economy_Variation365",
                    "score": 1,
                    "body": "They may have a tech on call but he doesn't sleep in the machine room. Presumably the robot will be able to respond more quickly than a human to an urgent situation. In addition, the bot will not require a salary or overtime pay."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697399120,
                    "id": "k50onwz",
                    "parent_id": "t1_k5087vk",
                    "author": "Distinct-Question-16",
                    "score": 2,
                    "body": "Full automatized Dvd cd kiosks were impressive"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697398362,
                    "id": "k50mjfb",
                    "parent_id": "t1_k508eg6",
                    "author": "Arcosim",
                    "score": 1,
                    "body": ">but he doesn't sleep in the machine room.\n\nDo you think data centers hire just one guy? I'm talking about actual data centers, the ones with enough money to consider buying robots, not some amateur \"data center\"."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697414415,
                    "id": "k51rqls",
                    "parent_id": "t1_k50mjfb",
                    "author": "Economy_Variation365",
                    "score": 0,
                    "body": "No matter how many technicians are on call, they don't sleep in the server room. The robot response time will be shorter than the human response time."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415317,
                    "id": "k51ttnf",
                    "parent_id": "t1_k51rqls",
                    "author": "Arcosim",
                    "score": 1,
                    "body": "> they don't sleep in the server room.  \n\nThey have rotations of technicians. This is pointless, you have no idea how a data center works."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697415810,
                    "id": "k51uz5h",
                    "parent_id": "t1_k51ttnf",
                    "author": "Economy_Variation365",
                    "score": 1,
                    "body": "My research involves a university supercomputer center and I've visited the server room many times. Whether there are 10 or 1000 technicians on duty, they do not camp out in the room. Therefore a robot parked on location can respond faster than any human. Why is this so difficult for you to understand?"
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697422575,
                    "id": "k52amrn",
                    "parent_id": "t1_k51uz5h",
                    "author": "Arcosim",
                    "score": 1,
                    "body": "You still think data centers don't have at the very least an in-site skeleton crew to fix problems at all times. But nice story by the way, very creative."
                },
                {
                    "py/object": "module_1.redder.comment",
                    "creationTime": 1697424994,
                    "id": "k52fxyp",
                    "parent_id": "t1_k52amrn",
                    "author": "Economy_Variation365",
                    "score": 1,
                    "body": "You either have reading comprehension issues or you're a troll. Either way, not worth any more of my time."
                }
            ]
        }
    ]
}